using System.Collections.Generic;
using System.Text.RegularExpressions;
namespace MacString.Internal {
    internal static class MacCharTable {
        internal static readonly char[] 結合文字 = new[]{
            '\u0300',  // ̀
            '\u0301',  // ́
            '\u0302',  // ̂
            '\u0303',  // ̃
            '\u0308',  // ̈
            '\u030A',  // ̊
            '\u0327',  // ̧
            '\u0304',  // ̄
            '\u0306',  // ̆
            '\u0328',  // ̨
            '\u0307',  // ̇
            '\u030C',  // ̌
            '\u030B',  // ̋
            '\u031B',  // ̛
            '\u030F',  // ̏
            '\u0311',  // ̑
            '\u0326',  // ̦
            '\u0653',  // ٓ
            '\u0654',  // ٔ
            '\u0655',  // ٕ
            '\u093C',  // ़
            '\u09BE',  // া
            '\u09D7',  // ৗ
            '\u09BC',  // ়
            '\u0A3C',  // ਼
            '\u0B56',  // ୖ
            '\u0B3E',  // ା
            '\u0B57',  // ୗ
            '\u0B3C',  // ଼
            '\u0BD7',  // ௗ
            '\u0BBE',  // ா
            '\u0C56',  // ౖ
            '\u0CD5',  // ೕ
            '\u0CD6',  // ೖ
            '\u0CC2',  // ೂ
            '\u0D3E',  // ാ
            '\u0D57',  // ൗ
            '\u0DCA',  // ්
            '\u0DCF',  // ා
            '\u0DDF',  // ෟ
            '\u0FB7',  // ྷ
            '\u0FB5',  // ྵ
            '\u0F72',  // ི
            '\u0F74',  // ུ
            '\u0F80',  // ྀ
            '\u102E',  // ီ
            '\u1B35',  // ᬵ
            '\u0325',  // ̥
            '\u0323',  // ̣
            '\u0331',  // ̱
            '\u032D',  // ̭
            '\u0330',  // ̰
            '\u032E',  // ̮
            '\u0324',  // ̤
            '\u0309',  // ̉
            '\u0313',  // ̓
            '\u0314',  // ̔
            '\u0345',  // ͅ
            '\u0342',  // ͂
            '\u3099',  // ゙
            '\u309A',  // ゚
            '\u1161',  // ᅡ
            '\u1162',  // ᅢ
            '\u1163',  // ᅣ
            '\u1164',  // ᅤ
            '\u1165',  // ᅥ
            '\u1166',  // ᅦ
            '\u1167',  // ᅧ
            '\u1168',  // ᅨ
            '\u1169',  // ᅩ
            '\u116A',  // ᅪ
            '\u116B',  // ᅫ
            '\u116C',  // ᅬ
            '\u116D',  // ᅭ
            '\u116E',  // ᅮ
            '\u116F',  // ᅯ
            '\u1170',  // ᅰ
            '\u1171',  // ᅱ
            '\u1172',  // ᅲ
            '\u1173',  // ᅳ
            '\u1174',  // ᅴ
            '\u1175',  // ᅵ
            '\u05B4',  // ִ
            '\u05B7',  // ַ
            '\u05C1',  // ׁ
            '\u05C2',  // ׂ
            '\u05B8',  // ָ
            '\u05BC',  // ּ
            '\u05B9',  // ֹ
            '\u05BF',  // ֿ
            '\u0338',  // ̸
            '\uDEEE',  // �
            '\uDC4A',  // �
            '\uDC44',  // �
            '\uDFD5',  // �
            '\uDE49',  // �
            '\uDCD0',  // �
            '\uDED3',  // �
        };

        internal static readonly char[] 革新的結合文字 = new[]{
            '\u0300',  // ̀
            '\u0301',  // ́
            '\u0302',  // ̂
            '\u0303',  // ̃
            '\u0308',  // ̈
            '\u030A',  // ̊
            '\u0327',  // ̧
            '\u0304',  // ̄
            '\u0306',  // ̆
            '\u0328',  // ̨
            '\u0307',  // ̇
            '\u030C',  // ̌
            '\u030B',  // ̋
            '\u031B',  // ̛
            '\u030F',  // ̏
            '\u0311',  // ̑
            '\u0326',  // ̦
            '\u0653',  // ٓ
            '\u0654',  // ٔ
            '\u0655',  // ٕ
            '\u093C',  // ़
            '\u09BE',  // া
            '\u09D7',  // ৗ
            '\u09BC',  // ়
            '\u0A3C',  // ਼
            '\u0B56',  // ୖ
            '\u0B3E',  // ା
            '\u0B57',  // ୗ
            '\u0B3C',  // ଼
            '\u0BD7',  // ௗ
            '\u0BBE',  // ா
            '\u0C56',  // ౖ
            '\u0CD5',  // ೕ
            '\u0CD6',  // ೖ
            '\u0CC2',  // ೂ
            '\u0D3E',  // ാ
            '\u0D57',  // ൗ
            '\u0DCA',  // ්
            '\u0DCF',  // ා
            '\u0DDF',  // ෟ
            '\u0FB7',  // ྷ
            '\u0FB5',  // ྵ
            '\u0F72',  // ི
            '\u0F74',  // ུ
            '\u0F80',  // ྀ
            '\u102E',  // ီ
            '\u1B35',  // ᬵ
            '\u0325',  // ̥
            '\u0323',  // ̣
            '\u0331',  // ̱
            '\u032D',  // ̭
            '\u0330',  // ̰
            '\u032E',  // ̮
            '\u0324',  // ̤
            '\u0309',  // ̉
            '\u0313',  // ̓
            '\u0314',  // ̔
            '\u0345',  // ͅ
            '\u0342',  // ͂
            '\u309B',  // ゙
            '\u309C',  // ゚
            '\u1161',  // ᅡ
            '\u1162',  // ᅢ
            '\u1163',  // ᅣ
            '\u1164',  // ᅤ
            '\u1165',  // ᅥ
            '\u1166',  // ᅦ
            '\u1167',  // ᅧ
            '\u1168',  // ᅨ
            '\u1169',  // ᅩ
            '\u116A',  // ᅪ
            '\u116B',  // ᅫ
            '\u116C',  // ᅬ
            '\u116D',  // ᅭ
            '\u116E',  // ᅮ
            '\u116F',  // ᅯ
            '\u1170',  // ᅰ
            '\u1171',  // ᅱ
            '\u1172',  // ᅲ
            '\u1173',  // ᅳ
            '\u1174',  // ᅴ
            '\u1175',  // ᅵ
            '\u05B4',  // ִ
            '\u05B7',  // ַ
            '\u05C1',  // ׁ
            '\u05C2',  // ׂ
            '\u05B8',  // ָ
            '\u05BC',  // ּ
            '\u05B9',  // ֹ
            '\u05BF',  // ֿ
            '\u0338',  // ̸
            '\uDEEE',  // �
            '\uDC4A',  // �
            '\uDC44',  // �
            '\uDFD5',  // �
            '\uDE49',  // �
            '\uDCD0',  // �
            '\uDED3',  // �
        };

        internal static readonly Regex 超絶正規表現 = new Regex(@"[\u00C0\u00C1\u00C2\u00C3\u00C4\u00C5\u00C7\u00C8\u00C9\u00CA\u00CB\u00CC\u00CD\u00CE\u00CF\u00D1\u00D2\u00D3\u00D4\u00D5\u00D6\u00D9\u00DA\u00DB\u00DC\u00DD\u00E0\u00E1\u00E2\u00E3\u00E4\u00E5\u00E7\u00E8\u00E9\u00EA\u00EB\u00EC\u00ED\u00EE\u00EF\u00F1\u00F2\u00F3\u00F4\u00F5\u00F6\u00F9\u00FA\u00FB\u00FC\u00FD\u00FF\u0100\u0101\u0102\u0103\u0104\u0105\u0106\u0107\u0108\u0109\u010A\u010B\u010C\u010D\u010E\u010F\u0112\u0113\u0114\u0115\u0116\u0117\u0118\u0119\u011A\u011B\u011C\u011D\u011E\u011F\u0120\u0121\u0122\u0123\u0124\u0125\u0128\u0129\u012A\u012B\u012C\u012D\u012E\u012F\u0130\u0134\u0135\u0136\u0137\u0139\u013A\u013B\u013C\u013D\u013E\u0143\u0144\u0145\u0146\u0147\u0148\u014C\u014D\u014E\u014F\u0150\u0151\u0154\u0155\u0156\u0157\u0158\u0159\u015A\u015B\u015C\u015D\u015E\u015F\u0160\u0161\u0162\u0163\u0164\u0165\u0168\u0169\u016A\u016B\u016C\u016D\u016E\u016F\u0170\u0171\u0172\u0173\u0174\u0175\u0176\u0177\u0178\u0179\u017A\u017B\u017C\u017D\u017E\u01A0\u01A1\u01AF\u01B0\u01CD\u01CE\u01CF\u01D0\u01D1\u01D2\u01D3\u01D4\u01E2\u01E3\u01E6\u01E7\u01E8\u01E9\u01EA\u01EB\u01EE\u01EF\u01F0\u01F4\u01F5\u01F8\u01F9\u01FC\u01FD\u01FE\u01FF\u0200\u0201\u0202\u0203\u0204\u0205\u0206\u0207\u0208\u0209\u020A\u020B\u020C\u020D\u020E\u020F\u0210\u0211\u0212\u0213\u0214\u0215\u0216\u0217\u0218\u0219\u021A\u021B\u021E\u021F\u0226\u0227\u0228\u0229\u022E\u022F\u0232\u0233\u0344\u0385\u0386\u0388\u0389\u038A\u038C\u038E\u038F\u03AA\u03AB\u03AC\u03AD\u03AE\u03AF\u03CA\u03CB\u03CC\u03CD\u03CE\u03D3\u03D4\u0400\u0401\u0403\u0407\u040C\u040D\u040E\u0419\u0439\u0450\u0451\u0453\u0457\u045C\u045D\u045E\u0476\u0477\u04C1\u04C2\u04D0\u04D1\u04D2\u04D3\u04D6\u04D7\u04DA\u04DB\u04DC\u04DD\u04DE\u04DF\u04E2\u04E3\u04E4\u04E5\u04E6\u04E7\u04EA\u04EB\u04EC\u04ED\u04EE\u04EF\u04F0\u04F1\u04F2\u04F3\u04F4\u04F5\u04F8\u04F9\u0622\u0623\u0624\u0625\u0626\u06C0\u06C2\u06D3\u0929\u0931\u0934\u0958\u0959\u095A\u095B\u095C\u095D\u095E\u095F\u09CB\u09CC\u09DC\u09DD\u09DF\u0A33\u0A36\u0A59\u0A5A\u0A5B\u0A5E\u0B48\u0B4B\u0B4C\u0B5C\u0B5D\u0B94\u0BCA\u0BCB\u0BCC\u0C48\u0CC0\u0CC7\u0CC8\u0CCA\u0D4A\u0D4B\u0D4C\u0DDA\u0DDC\u0DDE\u0F43\u0F4D\u0F52\u0F57\u0F5C\u0F69\u0F73\u0F75\u0F76\u0F78\u0F81\u0F93\u0F9D\u0FA2\u0FA7\u0FAC\u0FB9\u1026\u1B06\u1B08\u1B0A\u1B0C\u1B0E\u1B12\u1B3B\u1B3D\u1B40\u1B41\u1B43\u1E00\u1E01\u1E02\u1E03\u1E04\u1E05\u1E06\u1E07\u1E0A\u1E0B\u1E0C\u1E0D\u1E0E\u1E0F\u1E10\u1E11\u1E12\u1E13\u1E18\u1E19\u1E1A\u1E1B\u1E1E\u1E1F\u1E20\u1E21\u1E22\u1E23\u1E24\u1E25\u1E26\u1E27\u1E28\u1E29\u1E2A\u1E2B\u1E2C\u1E2D\u1E30\u1E31\u1E32\u1E33\u1E34\u1E35\u1E36\u1E37\u1E3A\u1E3B\u1E3C\u1E3D\u1E3E\u1E3F\u1E40\u1E41\u1E42\u1E43\u1E44\u1E45\u1E46\u1E47\u1E48\u1E49\u1E4A\u1E4B\u1E54\u1E55\u1E56\u1E57\u1E58\u1E59\u1E5A\u1E5B\u1E5E\u1E5F\u1E60\u1E61\u1E62\u1E63\u1E6A\u1E6B\u1E6C\u1E6D\u1E6E\u1E6F\u1E70\u1E71\u1E72\u1E73\u1E74\u1E75\u1E76\u1E77\u1E7C\u1E7D\u1E7E\u1E7F\u1E80\u1E81\u1E82\u1E83\u1E84\u1E85\u1E86\u1E87\u1E88\u1E89\u1E8A\u1E8B\u1E8C\u1E8D\u1E8E\u1E8F\u1E90\u1E91\u1E92\u1E93\u1E94\u1E95\u1E96\u1E97\u1E98\u1E99\u1E9B\u1EA0\u1EA1\u1EA2\u1EA3\u1EB8\u1EB9\u1EBA\u1EBB\u1EBC\u1EBD\u1EC8\u1EC9\u1ECA\u1ECB\u1ECC\u1ECD\u1ECE\u1ECF\u1EE4\u1EE5\u1EE6\u1EE7\u1EF2\u1EF3\u1EF4\u1EF5\u1EF6\u1EF7\u1EF8\u1EF9\u1F00\u1F01\u1F08\u1F09\u1F10\u1F11\u1F18\u1F19\u1F20\u1F21\u1F28\u1F29\u1F30\u1F31\u1F38\u1F39\u1F40\u1F41\u1F48\u1F49\u1F50\u1F51\u1F59\u1F60\u1F61\u1F68\u1F69\u1F70\u1F71\u1F72\u1F73\u1F74\u1F75\u1F76\u1F77\u1F78\u1F79\u1F7A\u1F7B\u1F7C\u1F7D\u1FB0\u1FB1\u1FB3\u1FB6\u1FB8\u1FB9\u1FBA\u1FBB\u1FBC\u1FC1\u1FC3\u1FC6\u1FC8\u1FC9\u1FCA\u1FCB\u1FCC\u1FCD\u1FCE\u1FCF\u1FD0\u1FD1\u1FD6\u1FD8\u1FD9\u1FDA\u1FDB\u1FDD\u1FDE\u1FDF\u1FE0\u1FE1\u1FE4\u1FE5\u1FE6\u1FE8\u1FE9\u1FEA\u1FEB\u1FEC\u1FED\u1FEE\u1FF3\u1FF6\u1FF8\u1FF9\u1FFA\u1FFB\u1FFC\u304C\u304E\u3050\u3052\u3054\u3056\u3058\u305A\u305C\u305E\u3060\u3062\u3065\u3067\u3069\u3070\u3071\u3073\u3074\u3076\u3077\u3079\u307A\u307C\u307D\u3094\u309E\u30AC\u30AE\u30B0\u30B2\u30B4\u30B6\u30B8\u30BA\u30BC\u30BE\u30C0\u30C2\u30C5\u30C7\u30C9\u30D0\u30D1\u30D3\u30D4\u30D6\u30D7\u30D9\u30DA\u30DC\u30DD\u30F4\u30F7\u30F8\u30F9\u30FA\u30FE\uAC00\uAC1C\uAC38\uAC54\uAC70\uAC8C\uACA8\uACC4\uACE0\uACFC\uAD18\uAD34\uAD50\uAD6C\uAD88\uADA4\uADC0\uADDC\uADF8\uAE14\uAE30\uAE4C\uAE68\uAE84\uAEA0\uAEBC\uAED8\uAEF4\uAF10\uAF2C\uAF48\uAF64\uAF80\uAF9C\uAFB8\uAFD4\uAFF0\uB00C\uB028\uB044\uB060\uB07C\uB098\uB0B4\uB0D0\uB0EC\uB108\uB124\uB140\uB15C\uB178\uB194\uB1B0\uB1CC\uB1E8\uB204\uB220\uB23C\uB258\uB274\uB290\uB2AC\uB2C8\uB2E4\uB300\uB31C\uB338\uB354\uB370\uB38C\uB3A8\uB3C4\uB3E0\uB3FC\uB418\uB434\uB450\uB46C\uB488\uB4A4\uB4C0\uB4DC\uB4F8\uB514\uB530\uB54C\uB568\uB584\uB5A0\uB5BC\uB5D8\uB5F4\uB610\uB62C\uB648\uB664\uB680\uB69C\uB6B8\uB6D4\uB6F0\uB70C\uB728\uB744\uB760\uB77C\uB798\uB7B4\uB7D0\uB7EC\uB808\uB824\uB840\uB85C\uB878\uB894\uB8B0\uB8CC\uB8E8\uB904\uB920\uB93C\uB958\uB974\uB990\uB9AC\uB9C8\uB9E4\uBA00\uBA1C\uBA38\uBA54\uBA70\uBA8C\uBAA8\uBAC4\uBAE0\uBAFC\uBB18\uBB34\uBB50\uBB6C\uBB88\uBBA4\uBBC0\uBBDC\uBBF8\uBC14\uBC30\uBC4C\uBC68\uBC84\uBCA0\uBCBC\uBCD8\uBCF4\uBD10\uBD2C\uBD48\uBD64\uBD80\uBD9C\uBDB8\uBDD4\uBDF0\uBE0C\uBE28\uBE44\uBE60\uBE7C\uBE98\uBEB4\uBED0\uBEEC\uBF08\uBF24\uBF40\uBF5C\uBF78\uBF94\uBFB0\uBFCC\uBFE8\uC004\uC020\uC03C\uC058\uC074\uC090\uC0AC\uC0C8\uC0E4\uC100\uC11C\uC138\uC154\uC170\uC18C\uC1A8\uC1C4\uC1E0\uC1FC\uC218\uC234\uC250\uC26C\uC288\uC2A4\uC2C0\uC2DC\uC2F8\uC314\uC330\uC34C\uC368\uC384\uC3A0\uC3BC\uC3D8\uC3F4\uC410\uC42C\uC448\uC464\uC480\uC49C\uC4B8\uC4D4\uC4F0\uC50C\uC528\uC544\uC560\uC57C\uC598\uC5B4\uC5D0\uC5EC\uC608\uC624\uC640\uC65C\uC678\uC694\uC6B0\uC6CC\uC6E8\uC704\uC720\uC73C\uC758\uC774\uC790\uC7AC\uC7C8\uC7E4\uC800\uC81C\uC838\uC854\uC870\uC88C\uC8A8\uC8C4\uC8E0\uC8FC\uC918\uC934\uC950\uC96C\uC988\uC9A4\uC9C0\uC9DC\uC9F8\uCA14\uCA30\uCA4C\uCA68\uCA84\uCAA0\uCABC\uCAD8\uCAF4\uCB10\uCB2C\uCB48\uCB64\uCB80\uCB9C\uCBB8\uCBD4\uCBF0\uCC0C\uCC28\uCC44\uCC60\uCC7C\uCC98\uCCB4\uCCD0\uCCEC\uCD08\uCD24\uCD40\uCD5C\uCD78\uCD94\uCDB0\uCDCC\uCDE8\uCE04\uCE20\uCE3C\uCE58\uCE74\uCE90\uCEAC\uCEC8\uCEE4\uCF00\uCF1C\uCF38\uCF54\uCF70\uCF8C\uCFA8\uCFC4\uCFE0\uCFFC\uD018\uD034\uD050\uD06C\uD088\uD0A4\uD0C0\uD0DC\uD0F8\uD114\uD130\uD14C\uD168\uD184\uD1A0\uD1BC\uD1D8\uD1F4\uD210\uD22C\uD248\uD264\uD280\uD29C\uD2B8\uD2D4\uD2F0\uD30C\uD328\uD344\uD360\uD37C\uD398\uD3B4\uD3D0\uD3EC\uD408\uD424\uD440\uD45C\uD478\uD494\uD4B0\uD4CC\uD4E8\uD504\uD520\uD53C\uD558\uD574\uD590\uD5AC\uD5C8\uD5E4\uD600\uD61C\uD638\uD654\uD670\uD68C\uD6A8\uD6C4\uD6E0\uD6FC\uD718\uD734\uD750\uD76C\uD788\uFB1D\uFB1F\uFB2A\uFB2B\uFB2E\uFB2F\uFB30\uFB31\uFB32\uFB33\uFB34\uFB35\uFB36\uFB38\uFB39\uFB3A\uFB3B\uFB3C\uFB3E\uFB40\uFB41\uFB43\uFB44\uFB46\uFB47\uFB48\uFB49\uFB4A\uFB4B\uFB4C\uFB4D\uFB4E\u212B\u219A\u219B\u21AE\u21CD\u21CE\u21CF\u2204\u2209\u220C\u2224\u2226\u2241\u2244\u2247\u2249\u2260\u2262\u226D\u226E\u226F\u2270\u2271\u2274\u2275\u2278\u2279\u2280\u2281\u2284\u2285\u2288\u2289\u22AC\u22AD\u22AE\u22AF\u22E0\u22E1\u22E2\u22E3\u22EA\u22EB\u22EC\u22ED\u2ADC\uFA6C\uFACF\uFAD0\uFAD1\uFAD5\uFAD6\uFAD7]");
        internal static readonly ぉ[] むあすと= new[]{
            new ぉ('\uFAD7', 74360, 97), new ぉ('\uFAD6', 74367, 96), new ぉ('\uFAD5', 74369, 95), new ぉ('\uFAD1', 74373, 94),
            new ぉ('\uFAD0', 74374, 93), new ぉ('\uFACF', 74373, 92), new ぉ('\uFA6C', 74268, 91), new ぉ('\u2ADC', 65535, 90),
            new ぉ('\u22ED', 65592, 90), new ぉ('\u22EC', 65592, 90), new ぉ('\u22EB', 65592, 90), new ぉ('\u22EA', 65592, 90),
            new ぉ('\u22E3', 65617, 90), new ぉ('\u22E2', 65617, 90), new ぉ('\u22E1', 65636, 90), new ぉ('\u22E0', 65636, 90),
            new ぉ('\u22AF', 65540, 90), new ぉ('\u22AE', 65541, 90), new ぉ('\u22AD', 65541, 90), new ぉ('\u22AC', 65546, 90),
            new ぉ('\u2289', 65538, 90), new ぉ('\u2288', 65538, 90), new ぉ('\u2285', 65538, 90), new ぉ('\u2284', 65538, 90),
            new ぉ('\u2281', 65542, 90), new ぉ('\u2280', 65542, 90), new ぉ('\u2279', 65538, 90), new ぉ('\u2278', 65538, 90),
            new ぉ('\u2275', 65538, 90), new ぉ('\u2274', 65538, 90), new ぉ('\u2271', 65548, 90), new ぉ('\u2270', 65548, 90),
            new ぉ('\u226F', 74289, 90), new ぉ('\u226E', 74290, 90), new ぉ('\u226D', 65568, 90), new ぉ('\u2262', 65537, 90),
            new ぉ('\u2260', 74275, 90), new ぉ('\u2249', 65537, 90), new ぉ('\u2247', 65538, 90), new ぉ('\u2244', 65537, 90),
            new ぉ('\u2241', 65541, 90), new ぉ('\u2226', 65537, 90), new ぉ('\u2224', 65537, 90), new ぉ('\u220C', 65537, 90),
            new ぉ('\u2209', 65537, 90), new ぉ('\u2204', 65537, 90), new ぉ('\u21CF', 65533, 90), new ぉ('\u21CE', 65530, 90),
            new ぉ('\u21CD', 65533, 90), new ぉ('\u21AE', 65562, 90), new ぉ('\u219B', 65545, 90), new ぉ('\u219A', 65546, 90),
            new ぉ('\u212B', 73962, 5), new ぉ('\uFB4E', 62826, 89), new ぉ('\uFB4D', 62834, 89), new ぉ('\uFB4C', 62843, 89),
            new ぉ('\uFB4B', 62838, 88), new ぉ('\uFB4A', 62816, 87), new ぉ('\uFB49', 62816, 87), new ぉ('\uFB48', 62816, 87),
            new ぉ('\uFB47', 62816, 87), new ぉ('\uFB46', 62816, 87), new ぉ('\uFB44', 62816, 87), new ぉ('\uFB43', 62816, 87),
            new ぉ('\uFB41', 62816, 87), new ぉ('\uFB40', 62816, 87), new ぉ('\uFB3E', 62816, 87), new ぉ('\uFB3C', 62816, 87),
            new ぉ('\uFB3B', 62816, 87), new ぉ('\uFB3A', 62816, 87), new ぉ('\uFB39', 62816, 87), new ぉ('\uFB38', 62816, 87),
            new ぉ('\uFB36', 62816, 87), new ぉ('\uFB35', 62816, 87), new ぉ('\uFB34', 62816, 87), new ぉ('\uFB33', 62816, 87),
            new ぉ('\uFB32', 62816, 87), new ぉ('\uFB31', 62816, 87), new ぉ('\uFB30', 62816, 87), new ぉ('\uFB2F', 62815, 86),
            new ぉ('\uFB2E', 62814, 83), new ぉ('\uFB2B', 62786, 85), new ぉ('\uFB2A', 62785, 84), new ぉ('\uFB1F', 62765, 83),
            new ぉ('\uFB1D', 62788, 82), new ぉ('\uD788', 50806, 81), new ぉ('\uD76C', 50778, 80), new ぉ('\uD750', 50750, 79),
            new ぉ('\uD734', 50722, 78), new ぉ('\uD718', 50694, 77), new ぉ('\uD6FC', 50666, 76), new ぉ('\uD6E0', 50638, 75),
            new ぉ('\uD6C4', 50610, 74), new ぉ('\uD6A8', 50582, 73), new ぉ('\uD68C', 50554, 72), new ぉ('\uD670', 50526, 71),
            new ぉ('\uD654', 50498, 70), new ぉ('\uD638', 50470, 69), new ぉ('\uD61C', 50442, 68), new ぉ('\uD600', 50414, 67),
            new ぉ('\uD5E4', 50386, 66), new ぉ('\uD5C8', 50358, 65), new ぉ('\uD5AC', 50330, 64), new ぉ('\uD590', 50302, 63),
            new ぉ('\uD574', 50274, 62), new ぉ('\uD558', 50246, 61), new ぉ('\uD53C', 50219, 81), new ぉ('\uD520', 50191, 80),
            new ぉ('\uD504', 50163, 79), new ぉ('\uD4E8', 50135, 78), new ぉ('\uD4CC', 50107, 77), new ぉ('\uD4B0', 50079, 76),
            new ぉ('\uD494', 50051, 75), new ぉ('\uD478', 50023, 74), new ぉ('\uD45C', 49995, 73), new ぉ('\uD440', 49967, 72),
            new ぉ('\uD424', 49939, 71), new ぉ('\uD408', 49911, 70), new ぉ('\uD3EC', 49883, 69), new ぉ('\uD3D0', 49855, 68),
            new ぉ('\uD3B4', 49827, 67), new ぉ('\uD398', 49799, 66), new ぉ('\uD37C', 49771, 65), new ぉ('\uD360', 49743, 64),
            new ぉ('\uD344', 49715, 63), new ぉ('\uD328', 49687, 62), new ぉ('\uD30C', 49659, 61), new ぉ('\uD2F0', 49632, 81),
            new ぉ('\uD2D4', 49604, 80), new ぉ('\uD2B8', 49576, 79), new ぉ('\uD29C', 49548, 78), new ぉ('\uD280', 49520, 77),
            new ぉ('\uD264', 49492, 76), new ぉ('\uD248', 49464, 75), new ぉ('\uD22C', 49436, 74), new ぉ('\uD210', 49408, 73),
            new ぉ('\uD1F4', 49380, 72), new ぉ('\uD1D8', 49352, 71), new ぉ('\uD1BC', 49324, 70), new ぉ('\uD1A0', 49296, 69),
            new ぉ('\uD184', 49268, 68), new ぉ('\uD168', 49240, 67), new ぉ('\uD14C', 49212, 66), new ぉ('\uD130', 49184, 65),
            new ぉ('\uD114', 49156, 64), new ぉ('\uD0F8', 49128, 63), new ぉ('\uD0DC', 49100, 62), new ぉ('\uD0C0', 49072, 61),
            new ぉ('\uD0A4', 49045, 81), new ぉ('\uD088', 49017, 80), new ぉ('\uD06C', 48989, 79), new ぉ('\uD050', 48961, 78),
            new ぉ('\uD034', 48933, 77), new ぉ('\uD018', 48905, 76), new ぉ('\uCFFC', 48877, 75), new ぉ('\uCFE0', 48849, 74),
            new ぉ('\uCFC4', 48821, 73), new ぉ('\uCFA8', 48793, 72), new ぉ('\uCF8C', 48765, 71), new ぉ('\uCF70', 48737, 70),
            new ぉ('\uCF54', 48709, 69), new ぉ('\uCF38', 48681, 68), new ぉ('\uCF1C', 48653, 67), new ぉ('\uCF00', 48625, 66),
            new ぉ('\uCEE4', 48597, 65), new ぉ('\uCEC8', 48569, 64), new ぉ('\uCEAC', 48541, 63), new ぉ('\uCE90', 48513, 62),
            new ぉ('\uCE74', 48485, 61), new ぉ('\uCE58', 48458, 81), new ぉ('\uCE3C', 48430, 80), new ぉ('\uCE20', 48402, 79),
            new ぉ('\uCE04', 48374, 78), new ぉ('\uCDE8', 48346, 77), new ぉ('\uCDCC', 48318, 76), new ぉ('\uCDB0', 48290, 75),
            new ぉ('\uCD94', 48262, 74), new ぉ('\uCD78', 48234, 73), new ぉ('\uCD5C', 48206, 72), new ぉ('\uCD40', 48178, 71),
            new ぉ('\uCD24', 48150, 70), new ぉ('\uCD08', 48122, 69), new ぉ('\uCCEC', 48094, 68), new ぉ('\uCCD0', 48066, 67),
            new ぉ('\uCCB4', 48038, 66), new ぉ('\uCC98', 48010, 65), new ぉ('\uCC7C', 47982, 64), new ぉ('\uCC60', 47954, 63),
            new ぉ('\uCC44', 47926, 62), new ぉ('\uCC28', 47898, 61), new ぉ('\uCC0C', 47871, 81), new ぉ('\uCBF0', 47843, 80),
            new ぉ('\uCBD4', 47815, 79), new ぉ('\uCBB8', 47787, 78), new ぉ('\uCB9C', 47759, 77), new ぉ('\uCB80', 47731, 76),
            new ぉ('\uCB64', 47703, 75), new ぉ('\uCB48', 47675, 74), new ぉ('\uCB2C', 47647, 73), new ぉ('\uCB10', 47619, 72),
            new ぉ('\uCAF4', 47591, 71), new ぉ('\uCAD8', 47563, 70), new ぉ('\uCABC', 47535, 69), new ぉ('\uCAA0', 47507, 68),
            new ぉ('\uCA84', 47479, 67), new ぉ('\uCA68', 47451, 66), new ぉ('\uCA4C', 47423, 65), new ぉ('\uCA30', 47395, 64),
            new ぉ('\uCA14', 47367, 63), new ぉ('\uC9F8', 47339, 62), new ぉ('\uC9DC', 47311, 61), new ぉ('\uC9C0', 47284, 81),
            new ぉ('\uC9A4', 47256, 80), new ぉ('\uC988', 47228, 79), new ぉ('\uC96C', 47200, 78), new ぉ('\uC950', 47172, 77),
            new ぉ('\uC934', 47144, 76), new ぉ('\uC918', 47116, 75), new ぉ('\uC8FC', 47088, 74), new ぉ('\uC8E0', 47060, 73),
            new ぉ('\uC8C4', 47032, 72), new ぉ('\uC8A8', 47004, 71), new ぉ('\uC88C', 46976, 70), new ぉ('\uC870', 46948, 69),
            new ぉ('\uC854', 46920, 68), new ぉ('\uC838', 46892, 67), new ぉ('\uC81C', 46864, 66), new ぉ('\uC800', 46836, 65),
            new ぉ('\uC7E4', 46808, 64), new ぉ('\uC7C8', 46780, 63), new ぉ('\uC7AC', 46752, 62), new ぉ('\uC790', 46724, 61),
            new ぉ('\uC774', 46697, 81), new ぉ('\uC758', 46669, 80), new ぉ('\uC73C', 46641, 79), new ぉ('\uC720', 46613, 78),
            new ぉ('\uC704', 46585, 77), new ぉ('\uC6E8', 46557, 76), new ぉ('\uC6CC', 46529, 75), new ぉ('\uC6B0', 46501, 74),
            new ぉ('\uC694', 46473, 73), new ぉ('\uC678', 46445, 72), new ぉ('\uC65C', 46417, 71), new ぉ('\uC640', 46389, 70),
            new ぉ('\uC624', 46361, 69), new ぉ('\uC608', 46333, 68), new ぉ('\uC5EC', 46305, 67), new ぉ('\uC5D0', 46277, 66),
            new ぉ('\uC5B4', 46249, 65), new ぉ('\uC598', 46221, 64), new ぉ('\uC57C', 46193, 63), new ぉ('\uC560', 46165, 62),
            new ぉ('\uC544', 46137, 61), new ぉ('\uC528', 46110, 81), new ぉ('\uC50C', 46082, 80), new ぉ('\uC4F0', 46054, 79),
            new ぉ('\uC4D4', 46026, 78), new ぉ('\uC4B8', 45998, 77), new ぉ('\uC49C', 45970, 76), new ぉ('\uC480', 45942, 75),
            new ぉ('\uC464', 45914, 74), new ぉ('\uC448', 45886, 73), new ぉ('\uC42C', 45858, 72), new ぉ('\uC410', 45830, 71),
            new ぉ('\uC3F4', 45802, 70), new ぉ('\uC3D8', 45774, 69), new ぉ('\uC3BC', 45746, 68), new ぉ('\uC3A0', 45718, 67),
            new ぉ('\uC384', 45690, 66), new ぉ('\uC368', 45662, 65), new ぉ('\uC34C', 45634, 64), new ぉ('\uC330', 45606, 63),
            new ぉ('\uC314', 45578, 62), new ぉ('\uC2F8', 45550, 61), new ぉ('\uC2DC', 45523, 81), new ぉ('\uC2C0', 45495, 80),
            new ぉ('\uC2A4', 45467, 79), new ぉ('\uC288', 45439, 78), new ぉ('\uC26C', 45411, 77), new ぉ('\uC250', 45383, 76),
            new ぉ('\uC234', 45355, 75), new ぉ('\uC218', 45327, 74), new ぉ('\uC1FC', 45299, 73), new ぉ('\uC1E0', 45271, 72),
            new ぉ('\uC1C4', 45243, 71), new ぉ('\uC1A8', 45215, 70), new ぉ('\uC18C', 45187, 69), new ぉ('\uC170', 45159, 68),
            new ぉ('\uC154', 45131, 67), new ぉ('\uC138', 45103, 66), new ぉ('\uC11C', 45075, 65), new ぉ('\uC100', 45047, 64),
            new ぉ('\uC0E4', 45019, 63), new ぉ('\uC0C8', 44991, 62), new ぉ('\uC0AC', 44963, 61), new ぉ('\uC090', 44936, 81),
            new ぉ('\uC074', 44908, 80), new ぉ('\uC058', 44880, 79), new ぉ('\uC03C', 44852, 78), new ぉ('\uC020', 44824, 77),
            new ぉ('\uC004', 44796, 76), new ぉ('\uBFE8', 44768, 75), new ぉ('\uBFCC', 44740, 74), new ぉ('\uBFB0', 44712, 73),
            new ぉ('\uBF94', 44684, 72), new ぉ('\uBF78', 44656, 71), new ぉ('\uBF5C', 44628, 70), new ぉ('\uBF40', 44600, 69),
            new ぉ('\uBF24', 44572, 68), new ぉ('\uBF08', 44544, 67), new ぉ('\uBEEC', 44516, 66), new ぉ('\uBED0', 44488, 65),
            new ぉ('\uBEB4', 44460, 64), new ぉ('\uBE98', 44432, 63), new ぉ('\uBE7C', 44404, 62), new ぉ('\uBE60', 44376, 61),
            new ぉ('\uBE44', 44349, 81), new ぉ('\uBE28', 44321, 80), new ぉ('\uBE0C', 44293, 79), new ぉ('\uBDF0', 44265, 78),
            new ぉ('\uBDD4', 44237, 77), new ぉ('\uBDB8', 44209, 76), new ぉ('\uBD9C', 44181, 75), new ぉ('\uBD80', 44153, 74),
            new ぉ('\uBD64', 44125, 73), new ぉ('\uBD48', 44097, 72), new ぉ('\uBD2C', 44069, 71), new ぉ('\uBD10', 44041, 70),
            new ぉ('\uBCF4', 44013, 69), new ぉ('\uBCD8', 43985, 68), new ぉ('\uBCBC', 43957, 67), new ぉ('\uBCA0', 43929, 66),
            new ぉ('\uBC84', 43901, 65), new ぉ('\uBC68', 43873, 64), new ぉ('\uBC4C', 43845, 63), new ぉ('\uBC30', 43817, 62),
            new ぉ('\uBC14', 43789, 61), new ぉ('\uBBF8', 43762, 81), new ぉ('\uBBDC', 43734, 80), new ぉ('\uBBC0', 43706, 79),
            new ぉ('\uBBA4', 43678, 78), new ぉ('\uBB88', 43650, 77), new ぉ('\uBB6C', 43622, 76), new ぉ('\uBB50', 43594, 75),
            new ぉ('\uBB34', 43566, 74), new ぉ('\uBB18', 43538, 73), new ぉ('\uBAFC', 43510, 72), new ぉ('\uBAE0', 43482, 71),
            new ぉ('\uBAC4', 43454, 70), new ぉ('\uBAA8', 43426, 69), new ぉ('\uBA8C', 43398, 68), new ぉ('\uBA70', 43370, 67),
            new ぉ('\uBA54', 43342, 66), new ぉ('\uBA38', 43314, 65), new ぉ('\uBA1C', 43286, 64), new ぉ('\uBA00', 43258, 63),
            new ぉ('\uB9E4', 43230, 62), new ぉ('\uB9C8', 43202, 61), new ぉ('\uB9AC', 43175, 81), new ぉ('\uB990', 43147, 80),
            new ぉ('\uB974', 43119, 79), new ぉ('\uB958', 43091, 78), new ぉ('\uB93C', 43063, 77), new ぉ('\uB920', 43035, 76),
            new ぉ('\uB904', 43007, 75), new ぉ('\uB8E8', 42979, 74), new ぉ('\uB8CC', 42951, 73), new ぉ('\uB8B0', 42923, 72),
            new ぉ('\uB894', 42895, 71), new ぉ('\uB878', 42867, 70), new ぉ('\uB85C', 42839, 69), new ぉ('\uB840', 42811, 68),
            new ぉ('\uB824', 42783, 67), new ぉ('\uB808', 42755, 66), new ぉ('\uB7EC', 42727, 65), new ぉ('\uB7D0', 42699, 64),
            new ぉ('\uB7B4', 42671, 63), new ぉ('\uB798', 42643, 62), new ぉ('\uB77C', 42615, 61), new ぉ('\uB760', 42588, 81),
            new ぉ('\uB744', 42560, 80), new ぉ('\uB728', 42532, 79), new ぉ('\uB70C', 42504, 78), new ぉ('\uB6F0', 42476, 77),
            new ぉ('\uB6D4', 42448, 76), new ぉ('\uB6B8', 42420, 75), new ぉ('\uB69C', 42392, 74), new ぉ('\uB680', 42364, 73),
            new ぉ('\uB664', 42336, 72), new ぉ('\uB648', 42308, 71), new ぉ('\uB62C', 42280, 70), new ぉ('\uB610', 42252, 69),
            new ぉ('\uB5F4', 42224, 68), new ぉ('\uB5D8', 42196, 67), new ぉ('\uB5BC', 42168, 66), new ぉ('\uB5A0', 42140, 65),
            new ぉ('\uB584', 42112, 64), new ぉ('\uB568', 42084, 63), new ぉ('\uB54C', 42056, 62), new ぉ('\uB530', 42028, 61),
            new ぉ('\uB514', 42001, 81), new ぉ('\uB4F8', 41973, 80), new ぉ('\uB4DC', 41945, 79), new ぉ('\uB4C0', 41917, 78),
            new ぉ('\uB4A4', 41889, 77), new ぉ('\uB488', 41861, 76), new ぉ('\uB46C', 41833, 75), new ぉ('\uB450', 41805, 74),
            new ぉ('\uB434', 41777, 73), new ぉ('\uB418', 41749, 72), new ぉ('\uB3FC', 41721, 71), new ぉ('\uB3E0', 41693, 70),
            new ぉ('\uB3C4', 41665, 69), new ぉ('\uB3A8', 41637, 68), new ぉ('\uB38C', 41609, 67), new ぉ('\uB370', 41581, 66),
            new ぉ('\uB354', 41553, 65), new ぉ('\uB338', 41525, 64), new ぉ('\uB31C', 41497, 63), new ぉ('\uB300', 41469, 62),
            new ぉ('\uB2E4', 41441, 61), new ぉ('\uB2C8', 41414, 81), new ぉ('\uB2AC', 41386, 80), new ぉ('\uB290', 41358, 79),
            new ぉ('\uB274', 41330, 78), new ぉ('\uB258', 41302, 77), new ぉ('\uB23C', 41274, 76), new ぉ('\uB220', 41246, 75),
            new ぉ('\uB204', 41218, 74), new ぉ('\uB1E8', 41190, 73), new ぉ('\uB1CC', 41162, 72), new ぉ('\uB1B0', 41134, 71),
            new ぉ('\uB194', 41106, 70), new ぉ('\uB178', 41078, 69), new ぉ('\uB15C', 41050, 68), new ぉ('\uB140', 41022, 67),
            new ぉ('\uB124', 40994, 66), new ぉ('\uB108', 40966, 65), new ぉ('\uB0EC', 40938, 64), new ぉ('\uB0D0', 40910, 63),
            new ぉ('\uB0B4', 40882, 62), new ぉ('\uB098', 40854, 61), new ぉ('\uB07C', 40827, 81), new ぉ('\uB060', 40799, 80),
            new ぉ('\uB044', 40771, 79), new ぉ('\uB028', 40743, 78), new ぉ('\uB00C', 40715, 77), new ぉ('\uAFF0', 40687, 76),
            new ぉ('\uAFD4', 40659, 75), new ぉ('\uAFB8', 40631, 74), new ぉ('\uAF9C', 40603, 73), new ぉ('\uAF80', 40575, 72),
            new ぉ('\uAF64', 40547, 71), new ぉ('\uAF48', 40519, 70), new ぉ('\uAF2C', 40491, 69), new ぉ('\uAF10', 40463, 68),
            new ぉ('\uAEF4', 40435, 67), new ぉ('\uAED8', 40407, 66), new ぉ('\uAEBC', 40379, 65), new ぉ('\uAEA0', 40351, 64),
            new ぉ('\uAE84', 40323, 63), new ぉ('\uAE68', 40295, 62), new ぉ('\uAE4C', 40267, 61), new ぉ('\uAE30', 40240, 81),
            new ぉ('\uAE14', 40212, 80), new ぉ('\uADF8', 40184, 79), new ぉ('\uADDC', 40156, 78), new ぉ('\uADC0', 40128, 77),
            new ぉ('\uADA4', 40100, 76), new ぉ('\uAD88', 40072, 75), new ぉ('\uAD6C', 40044, 74), new ぉ('\uAD50', 40016, 73),
            new ぉ('\uAD34', 39988, 72), new ぉ('\uAD18', 39960, 71), new ぉ('\uACFC', 39932, 70), new ぉ('\uACE0', 39904, 69),
            new ぉ('\uACC4', 39876, 68), new ぉ('\uACA8', 39848, 67), new ぉ('\uAC8C', 39820, 66), new ぉ('\uAC70', 39792, 65),
            new ぉ('\uAC54', 39764, 64), new ぉ('\uAC38', 39736, 63), new ぉ('\uAC1C', 39708, 62), new ぉ('\uAC00', 39680, 61),
            new ぉ('\u30FE', 1, 59), new ぉ('\u30FA', 8, 59), new ぉ('\u30F9', 8, 59), new ぉ('\u30F8', 8, 59),
            new ぉ('\u30F7', 8, 59), new ぉ('\u30F4', 78, 59), new ぉ('\u30DD', 2, 60), new ぉ('\u30DC', 1, 59),
            new ぉ('\u30DA', 2, 60), new ぉ('\u30D9', 1, 59), new ぉ('\u30D7', 2, 60), new ぉ('\u30D6', 1, 59),
            new ぉ('\u30D4', 2, 60), new ぉ('\u30D3', 1, 59), new ぉ('\u30D1', 2, 60), new ぉ('\u30D0', 1, 59),
            new ぉ('\u30C9', 1, 59), new ぉ('\u30C7', 1, 59), new ぉ('\u30C5', 1, 59), new ぉ('\u30C2', 1, 59),
            new ぉ('\u30C0', 1, 59), new ぉ('\u30BE', 1, 59), new ぉ('\u30BC', 1, 59), new ぉ('\u30BA', 1, 59),
            new ぉ('\u30B8', 1, 59), new ぉ('\u30B6', 1, 59), new ぉ('\u30B4', 1, 59), new ぉ('\u30B2', 1, 59),
            new ぉ('\u30B0', 1, 59), new ぉ('\u30AE', 1, 59), new ぉ('\u30AC', 1, 59), new ぉ('\u309E', 1, 59),
            new ぉ('\u3094', 78, 59), new ぉ('\u307D', 2, 60), new ぉ('\u307C', 1, 59), new ぉ('\u307A', 2, 60),
            new ぉ('\u3079', 1, 59), new ぉ('\u3077', 2, 60), new ぉ('\u3076', 1, 59), new ぉ('\u3074', 2, 60),
            new ぉ('\u3073', 1, 59), new ぉ('\u3071', 2, 60), new ぉ('\u3070', 1, 59), new ぉ('\u3069', 1, 59),
            new ぉ('\u3067', 1, 59), new ぉ('\u3065', 1, 59), new ぉ('\u3062', 1, 59), new ぉ('\u3060', 1, 59),
            new ぉ('\u305E', 1, 59), new ぉ('\u305C', 1, 59), new ぉ('\u305A', 1, 59), new ぉ('\u3058', 1, 59),
            new ぉ('\u3056', 1, 59), new ぉ('\u3054', 1, 59), new ぉ('\u3052', 1, 59), new ぉ('\u3050', 1, 59),
            new ぉ('\u304E', 1, 59), new ぉ('\u304C', 1, 59), new ぉ('\u1FFC', 7251, 57), new ぉ('\u1FFB', 7250, 1),
            new ぉ('\u1FFA', 7249, 0), new ぉ('\u1FF9', 7258, 1), new ぉ('\u1FF8', 7257, 0), new ぉ('\u1FF6', 7213, 58),
            new ぉ('\u1FF3', 7210, 57), new ぉ('\u1FEE', 8006, 1), new ぉ('\u1FED', 8005, 0), new ぉ('\u1FEC', 7243, 56),
            new ぉ('\u1FEB', 7238, 1), new ぉ('\u1FEA', 7237, 0), new ぉ('\u1FE9', 7236, 7), new ぉ('\u1FE8', 7235, 8),
            new ぉ('\u1FE6', 7201, 58), new ぉ('\u1FE5', 7204, 56), new ぉ('\u1FE4', 7203, 55), new ぉ('\u1FE1', 7196, 7),
            new ぉ('\u1FE0', 7195, 8), new ぉ('\u1FDF', -31, 58), new ぉ('\u1FDE', -32, 1), new ぉ('\u1FDD', -33, 0),
            new ぉ('\u1FDB', 7234, 1), new ぉ('\u1FDA', 7233, 0), new ぉ('\u1FD9', 7232, 7), new ぉ('\u1FD8', 7231, 8),
            new ぉ('\u1FD6', 7197, 58), new ぉ('\u1FD1', 7192, 7), new ぉ('\u1FD0', 7191, 8), new ぉ('\u1FCF', 16, 58),
            new ぉ('\u1FCE', 15, 1), new ぉ('\u1FCD', 14, 0), new ぉ('\u1FCC', 7221, 57), new ぉ('\u1FCB', 7220, 1),
            new ぉ('\u1FCA', 7219, 0), new ぉ('\u1FC9', 7220, 1), new ぉ('\u1FC8', 7219, 0), new ぉ('\u1FC6', 7183, 58),
            new ぉ('\u1FC3', 7180, 57), new ぉ('\u1FC1', 7961, 58), new ぉ('\u1FBC', 7211, 57), new ぉ('\u1FBB', 7210, 1),
            new ぉ('\u1FBA', 7209, 0), new ぉ('\u1FB9', 7208, 7), new ぉ('\u1FB8', 7207, 8), new ぉ('\u1FB6', 7173, 58),
            new ぉ('\u1FB3', 7170, 57), new ぉ('\u1FB1', 7168, 7), new ぉ('\u1FB0', 7167, 8), new ぉ('\u1F7D', 7092, 1),
            new ぉ('\u1F7C', 7091, 0), new ぉ('\u1F7B', 7094, 1), new ぉ('\u1F7A', 7093, 0), new ぉ('\u1F79', 7098, 1),
            new ぉ('\u1F78', 7097, 0), new ぉ('\u1F77', 7102, 1), new ぉ('\u1F76', 7101, 0), new ぉ('\u1F75', 7102, 1),
            new ぉ('\u1F74', 7101, 0), new ぉ('\u1F73', 7102, 1), new ぉ('\u1F72', 7101, 0), new ぉ('\u1F71', 7104, 1),
            new ぉ('\u1F70', 7103, 0), new ぉ('\u1F69', 7104, 56), new ぉ('\u1F68', 7103, 55), new ぉ('\u1F61', 7064, 56),
            new ぉ('\u1F60', 7063, 55), new ぉ('\u1F59', 7092, 56), new ぉ('\u1F51', 7052, 56), new ぉ('\u1F50', 7051, 55),
            new ぉ('\u1F49', 7082, 56), new ぉ('\u1F48', 7081, 55), new ぉ('\u1F41', 7042, 56), new ぉ('\u1F40', 7041, 55),
            new ぉ('\u1F39', 7072, 56), new ぉ('\u1F38', 7071, 55), new ぉ('\u1F31', 7032, 56), new ぉ('\u1F30', 7031, 55),
            new ぉ('\u1F29', 7058, 56), new ぉ('\u1F28', 7057, 55), new ぉ('\u1F21', 7018, 56), new ぉ('\u1F20', 7017, 55),
            new ぉ('\u1F19', 7044, 56), new ぉ('\u1F18', 7043, 55), new ぉ('\u1F11', 7004, 56), new ぉ('\u1F10', 7003, 55),
            new ぉ('\u1F09', 7032, 56), new ぉ('\u1F08', 7031, 55), new ぉ('\u1F01', 6992, 56), new ぉ('\u1F00', 6991, 55),
            new ぉ('\u1EF9', 7808, 3), new ぉ('\u1EF8', 7839, 3), new ぉ('\u1EF7', 7806, 54), new ぉ('\u1EF6', 7837, 54),
            new ぉ('\u1EF5', 7804, 48), new ぉ('\u1EF4', 7835, 48), new ぉ('\u1EF3', 7802, 0), new ぉ('\u1EF2', 7833, 0),
            new ぉ('\u1EE7', 7794, 54), new ぉ('\u1EE6', 7825, 54), new ぉ('\u1EE5', 7792, 48), new ぉ('\u1EE4', 7823, 48),
            new ぉ('\u1ECF', 7776, 54), new ぉ('\u1ECE', 7807, 54), new ぉ('\u1ECD', 7774, 48), new ぉ('\u1ECC', 7805, 48),
            new ぉ('\u1ECB', 7778, 48), new ぉ('\u1ECA', 7809, 48), new ぉ('\u1EC9', 7776, 54), new ぉ('\u1EC8', 7807, 54),
            new ぉ('\u1EBD', 7768, 3), new ぉ('\u1EBC', 7799, 3), new ぉ('\u1EBB', 7766, 54), new ぉ('\u1EBA', 7797, 54),
            new ぉ('\u1EB9', 7764, 48), new ぉ('\u1EB8', 7795, 48), new ぉ('\u1EA3', 7746, 54), new ぉ('\u1EA2', 7777, 54),
            new ぉ('\u1EA1', 7744, 48), new ぉ('\u1EA0', 7775, 48), new ぉ('\u1E9B', 7452, 10), new ぉ('\u1E99', 7712, 5),
            new ぉ('\u1E98', 7713, 5), new ぉ('\u1E97', 7715, 4), new ぉ('\u1E96', 7726, 49), new ぉ('\u1E95', 7707, 49),
            new ぉ('\u1E94', 7738, 49), new ぉ('\u1E93', 7705, 48), new ぉ('\u1E92', 7736, 48), new ぉ('\u1E91', 7703, 2),
            new ぉ('\u1E90', 7734, 2), new ぉ('\u1E8F', 7702, 10), new ぉ('\u1E8E', 7733, 10), new ぉ('\u1E8D', 7701, 4),
            new ぉ('\u1E8C', 7732, 4), new ぉ('\u1E8B', 7699, 10), new ぉ('\u1E8A', 7730, 10), new ぉ('\u1E89', 7698, 48),
            new ぉ('\u1E88', 7729, 48), new ぉ('\u1E87', 7696, 10), new ぉ('\u1E86', 7727, 10), new ぉ('\u1E85', 7694, 4),
            new ぉ('\u1E84', 7725, 4), new ぉ('\u1E83', 7692, 1), new ぉ('\u1E82', 7723, 1), new ぉ('\u1E81', 7690, 0),
            new ぉ('\u1E80', 7721, 0), new ぉ('\u1E7F', 7689, 48), new ぉ('\u1E7E', 7720, 48), new ぉ('\u1E7D', 7687, 3),
            new ぉ('\u1E7C', 7718, 3), new ぉ('\u1E77', 7682, 50), new ぉ('\u1E76', 7713, 50), new ぉ('\u1E75', 7680, 51),
            new ぉ('\u1E74', 7711, 51), new ぉ('\u1E73', 7678, 53), new ぉ('\u1E72', 7709, 53), new ぉ('\u1E71', 7677, 50),
            new ぉ('\u1E70', 7708, 50), new ぉ('\u1E6F', 7675, 49), new ぉ('\u1E6E', 7706, 49), new ぉ('\u1E6D', 7673, 48),
            new ぉ('\u1E6C', 7704, 48), new ぉ('\u1E6B', 7671, 10), new ぉ('\u1E6A', 7702, 10), new ぉ('\u1E63', 7664, 48),
            new ぉ('\u1E62', 7695, 48), new ぉ('\u1E61', 7662, 10), new ぉ('\u1E60', 7693, 10), new ぉ('\u1E5F', 7661, 49),
            new ぉ('\u1E5E', 7692, 49), new ぉ('\u1E5B', 7657, 48), new ぉ('\u1E5A', 7688, 48), new ぉ('\u1E59', 7655, 10),
            new ぉ('\u1E58', 7686, 10), new ぉ('\u1E57', 7655, 10), new ぉ('\u1E56', 7686, 10), new ぉ('\u1E55', 7653, 1),
            new ぉ('\u1E54', 7684, 1), new ぉ('\u1E4B', 7645, 50), new ぉ('\u1E4A', 7676, 50), new ぉ('\u1E49', 7643, 49),
            new ぉ('\u1E48', 7674, 49), new ぉ('\u1E47', 7641, 48), new ぉ('\u1E46', 7672, 48), new ぉ('\u1E45', 7639, 10),
            new ぉ('\u1E44', 7670, 10), new ぉ('\u1E43', 7638, 48), new ぉ('\u1E42', 7669, 48), new ぉ('\u1E41', 7636, 10),
            new ぉ('\u1E40', 7667, 10), new ぉ('\u1E3F', 7634, 1), new ぉ('\u1E3E', 7665, 1), new ぉ('\u1E3D', 7633, 50),
            new ぉ('\u1E3C', 7664, 50), new ぉ('\u1E3B', 7631, 49), new ぉ('\u1E3A', 7662, 49), new ぉ('\u1E37', 7627, 48),
            new ぉ('\u1E36', 7658, 48), new ぉ('\u1E35', 7626, 49), new ぉ('\u1E34', 7657, 49), new ぉ('\u1E33', 7624, 48),
            new ぉ('\u1E32', 7655, 48), new ぉ('\u1E31', 7622, 1), new ぉ('\u1E30', 7653, 1), new ぉ('\u1E2D', 7620, 51),
            new ぉ('\u1E2C', 7651, 51), new ぉ('\u1E2B', 7619, 52), new ぉ('\u1E2A', 7650, 52), new ぉ('\u1E29', 7617, 6),
            new ぉ('\u1E28', 7648, 6), new ぉ('\u1E27', 7615, 4), new ぉ('\u1E26', 7646, 4), new ぉ('\u1E25', 7613, 48),
            new ぉ('\u1E24', 7644, 48), new ぉ('\u1E23', 7611, 10), new ぉ('\u1E22', 7642, 10), new ぉ('\u1E21', 7610, 7),
            new ぉ('\u1E20', 7641, 7), new ぉ('\u1E1F', 7609, 10), new ぉ('\u1E1E', 7640, 10), new ぉ('\u1E1B', 7606, 51),
            new ぉ('\u1E1A', 7637, 51), new ぉ('\u1E19', 7604, 50), new ぉ('\u1E18', 7635, 50), new ぉ('\u1E13', 7599, 50),
            new ぉ('\u1E12', 7630, 50), new ぉ('\u1E11', 7597, 6), new ぉ('\u1E10', 7628, 6), new ぉ('\u1E0F', 7595, 49),
            new ぉ('\u1E0E', 7626, 49), new ぉ('\u1E0D', 7593, 48), new ぉ('\u1E0C', 7624, 48), new ぉ('\u1E0B', 7591, 10),
            new ぉ('\u1E0A', 7622, 10), new ぉ('\u1E07', 7589, 49), new ぉ('\u1E06', 7620, 49), new ぉ('\u1E05', 7587, 48),
            new ぉ('\u1E04', 7618, 48), new ぉ('\u1E03', 7585, 10), new ぉ('\u1E02', 7616, 10), new ぉ('\u1E01', 7584, 47),
            new ぉ('\u1E00', 7615, 47), new ぉ('\u1B43', 1, 46), new ぉ('\u1B41', 2, 46), new ぉ('\u1B40', 2, 46),
            new ぉ('\u1B3D', 1, 46), new ぉ('\u1B3B', 1, 46), new ぉ('\u1B12', 1, 46), new ぉ('\u1B0E', 1, 46),
            new ぉ('\u1B0C', 1, 46), new ぉ('\u1B0A', 1, 46), new ぉ('\u1B08', 1, 46), new ぉ('\u1B06', 1, 46),
            new ぉ('\u1026', 1, 45), new ぉ('\u0FB9', 41, 41), new ぉ('\u0FAC', 1, 40), new ぉ('\u0FA7', 1, 40),
            new ぉ('\u0FA2', 1, 40), new ぉ('\u0F9D', 1, 40), new ぉ('\u0F93', 1, 40), new ぉ('\u0F81', 16, 44),
            new ぉ('\u0F78', -59, 44), new ぉ('\u0F76', -60, 44), new ぉ('\u0F75', 4, 43), new ぉ('\u0F73', 2, 42),
            new ぉ('\u0F69', 41, 41), new ぉ('\u0F5C', 1, 40), new ぉ('\u0F57', 1, 40), new ぉ('\u0F52', 1, 40),
            new ぉ('\u0F4D', 1, 40), new ぉ('\u0F43', 1, 40), new ぉ('\u0DDE', 5, 39), new ぉ('\u0DDC', 3, 38),
            new ぉ('\u0DDA', 1, 37), new ぉ('\u0D4C', 6, 36), new ぉ('\u0D4B', 4, 35), new ぉ('\u0D4A', 4, 35),
            new ぉ('\u0CCA', 4, 34), new ぉ('\u0CC8', 2, 33), new ぉ('\u0CC7', 1, 32), new ぉ('\u0CC0', 1, 32),
            new ぉ('\u0C48', 2, 31), new ぉ('\u0BCC', 6, 29), new ぉ('\u0BCB', 4, 30), new ぉ('\u0BCA', 4, 30),
            new ぉ('\u0B94', 2, 29), new ぉ('\u0B5D', 59, 28), new ぉ('\u0B5C', 59, 28), new ぉ('\u0B4C', 5, 27),
            new ぉ('\u0B4B', 4, 26), new ぉ('\u0B48', 1, 25), new ぉ('\u0A5E', 51, 24), new ぉ('\u0A5B', 63, 24),
            new ぉ('\u0A5A', 67, 24), new ぉ('\u0A59', 67, 24), new ぉ('\u0A36', -2, 24), new ぉ('\u0A33', 1, 24),
            new ぉ('\u09DF', 48, 23), new ぉ('\u09DD', 59, 23), new ぉ('\u09DC', 59, 23), new ぉ('\u09CC', 5, 22),
            new ぉ('\u09CB', 4, 21), new ぉ('\u095F', 48, 20), new ぉ('\u095E', 51, 20), new ぉ('\u095D', 59, 20),
            new ぉ('\u095C', 59, 20), new ぉ('\u095B', 63, 20), new ぉ('\u095A', 67, 20), new ぉ('\u0959', 67, 20),
            new ぉ('\u0958', 67, 20), new ぉ('\u0934', 1, 20), new ぉ('\u0931', 1, 20), new ぉ('\u0929', 1, 20),
            new ぉ('\u06D3', 1, 18), new ぉ('\u06C2', 1, 18), new ぉ('\u06C0', -21, 18), new ぉ('\u0626', -36, 18),
            new ぉ('\u0625', -2, 19), new ぉ('\u0624', -36, 18), new ぉ('\u0623', -4, 18), new ぉ('\u0622', -5, 17),
            new ぉ('\u04F9', 174, 4), new ぉ('\u04F8', 205, 4), new ぉ('\u04F5', 174, 4), new ぉ('\u04F4', 205, 4),
            new ぉ('\u04F3', 176, 12), new ぉ('\u04F2', 207, 12), new ぉ('\u04F1', 174, 4), new ぉ('\u04F0', 205, 4),
            new ぉ('\u04EF', 172, 7), new ぉ('\u04EE', 203, 7), new ぉ('\u04ED', 160, 4), new ぉ('\u04EC', 191, 4),
            new ぉ('\u04EB', 2, 4), new ぉ('\u04EA', 2, 4), new ぉ('\u04E7', 169, 4), new ぉ('\u04E6', 200, 4),
            new ぉ('\u04E5', 173, 4), new ぉ('\u04E4', 204, 4), new ぉ('\u04E3', 171, 7), new ぉ('\u04E2', 202, 7),
            new ぉ('\u04DF', 168, 4), new ぉ('\u04DE', 199, 4), new ぉ('\u04DD', 167, 4), new ぉ('\u04DC', 198, 4),
            new ぉ('\u04DB', 2, 4), new ぉ('\u04DA', 2, 4), new ぉ('\u04D7', 162, 8), new ぉ('\u04D6', 193, 8),
            new ぉ('\u04D3', 163, 4), new ぉ('\u04D2', 194, 4), new ぉ('\u04D1', 161, 8), new ぉ('\u04D0', 192, 8),
            new ぉ('\u04C2', 140, 8), new ぉ('\u04C1', 171, 8), new ぉ('\u0477', 2, 14), new ぉ('\u0476', 2, 14),
            new ぉ('\u045E', 27, 8), new ぉ('\u045D', 37, 0), new ぉ('\u045C', 34, 1), new ぉ('\u0457', 1, 4),
            new ぉ('\u0453', 32, 1), new ぉ('\u0451', 28, 4), new ぉ('\u0450', 27, 0), new ぉ('\u0439', 1, 8),
            new ぉ('\u0419', 1, 8), new ぉ('\u040E', -21, 8), new ぉ('\u040D', -11, 0), new ぉ('\u040C', -14, 1),
            new ぉ('\u0407', 1, 4), new ぉ('\u0403', -16, 1), new ぉ('\u0401', -20, 4), new ぉ('\u0400', -21, 0),
            new ぉ('\u03D4', 2, 4), new ぉ('\u03D3', 1, 1), new ぉ('\u03CE', 5, 1), new ぉ('\u03CD', 8, 1),
            new ぉ('\u03CC', 13, 1), new ぉ('\u03CB', 6, 4), new ぉ('\u03CA', 17, 4), new ぉ('\u03AF', -10, 1),
            new ぉ('\u03AE', -9, 1), new ぉ('\u03AD', -8, 1), new ぉ('\u03AC', -5, 1), new ぉ('\u03AB', 6, 4),
            new ぉ('\u03AA', 17, 4), new ぉ('\u038F', -26, 1), new ぉ('\u038E', -23, 1), new ぉ('\u038C', -19, 1),
            new ぉ('\u038A', -15, 1), new ぉ('\u0389', -14, 1), new ぉ('\u0388', -13, 1), new ぉ('\u0386', -11, 1),
            new ぉ('\u0385', 733, 1), new ぉ('\u0344', 60, 1), new ぉ('\u0233', 442, 7), new ぉ('\u0232', 473, 7),
            new ぉ('\u022F', 448, 10), new ぉ('\u022E', 479, 10), new ぉ('\u0229', 452, 6), new ぉ('\u0228', 483, 6),
            new ぉ('\u0227', 454, 10), new ぉ('\u0226', 485, 10), new ぉ('\u021F', 439, 11), new ぉ('\u021E', 470, 11),
            new ぉ('\u021B', 423, 16), new ぉ('\u021A', 454, 16), new ぉ('\u0219', 422, 16), new ぉ('\u0218', 453, 16),
            new ぉ('\u0217', 418, 15), new ぉ('\u0216', 449, 15), new ぉ('\u0215', 416, 14), new ぉ('\u0214', 447, 14),
            new ぉ('\u0213', 417, 15), new ぉ('\u0212', 448, 15), new ぉ('\u0211', 415, 14), new ぉ('\u0210', 446, 14),
            new ぉ('\u020F', 416, 15), new ぉ('\u020E', 447, 15), new ぉ('\u020D', 414, 14), new ぉ('\u020C', 445, 14),
            new ぉ('\u020B', 418, 15), new ぉ('\u020A', 449, 15), new ぉ('\u0209', 416, 14), new ぉ('\u0208', 447, 14),
            new ぉ('\u0207', 418, 15), new ぉ('\u0206', 449, 15), new ぉ('\u0205', 416, 14), new ぉ('\u0204', 447, 14),
            new ぉ('\u0203', 418, 15), new ぉ('\u0202', 449, 15), new ぉ('\u0201', 416, 14), new ぉ('\u0200', 447, 14),
            new ぉ('\u01FF', 263, 1), new ぉ('\u01FE', 294, 1), new ぉ('\u01FD', 279, 1), new ぉ('\u01FC', 310, 1),
            new ぉ('\u01F9', 395, 0), new ぉ('\u01F8', 426, 0), new ぉ('\u01F5', 398, 1), new ぉ('\u01F4', 429, 1),
            new ぉ('\u01F0', 390, 11), new ぉ('\u01EF', -163, 11), new ぉ('\u01EE', 55, 11), new ぉ('\u01EB', 380, 9),
            new ぉ('\u01EA', 411, 9), new ぉ('\u01E9', 382, 11), new ぉ('\u01E8', 413, 11), new ぉ('\u01E7', 384, 11),
            new ぉ('\u01E6', 415, 11), new ぉ('\u01E3', 253, 7), new ぉ('\u01E2', 284, 7), new ぉ('\u01D4', 351, 11),
            new ぉ('\u01D3', 382, 11), new ぉ('\u01D2', 355, 11), new ぉ('\u01D1', 386, 11), new ぉ('\u01D0', 359, 11),
            new ぉ('\u01CF', 390, 11), new ぉ('\u01CE', 365, 11), new ぉ('\u01CD', 396, 11), new ぉ('\u01B0', 315, 13),
            new ぉ('\u01AF', 346, 13), new ぉ('\u01A1', 306, 13), new ぉ('\u01A0', 337, 13), new ぉ('\u017E', 260, 11),
            new ぉ('\u017D', 291, 11), new ぉ('\u017C', 258, 10), new ぉ('\u017B', 289, 10), new ぉ('\u017A', 256, 1),
            new ぉ('\u0179', 287, 1), new ぉ('\u0178', 287, 4), new ぉ('\u0177', 254, 2), new ぉ('\u0176', 285, 2),
            new ぉ('\u0175', 254, 2), new ぉ('\u0174', 285, 2), new ぉ('\u0173', 254, 9), new ぉ('\u0172', 285, 9),
            new ぉ('\u0171', 252, 12), new ぉ('\u0170', 283, 12), new ぉ('\u016F', 250, 5), new ぉ('\u016E', 281, 5),
            new ぉ('\u016D', 248, 8), new ぉ('\u016C', 279, 8), new ぉ('\u016B', 246, 7), new ぉ('\u016A', 277, 7),
            new ぉ('\u0169', 244, 3), new ぉ('\u0168', 275, 3), new ぉ('\u0165', 241, 11), new ぉ('\u0164', 272, 11),
            new ぉ('\u0163', 239, 6), new ぉ('\u0162', 270, 6), new ぉ('\u0161', 238, 11), new ぉ('\u0160', 269, 11),
            new ぉ('\u015F', 236, 6), new ぉ('\u015E', 267, 6), new ぉ('\u015D', 234, 2), new ぉ('\u015C', 265, 2),
            new ぉ('\u015B', 232, 1), new ぉ('\u015A', 263, 1), new ぉ('\u0159', 231, 11), new ぉ('\u0158', 262, 11),
            new ぉ('\u0157', 229, 6), new ぉ('\u0156', 260, 6), new ぉ('\u0155', 227, 1), new ぉ('\u0154', 258, 1),
            new ぉ('\u0151', 226, 12), new ぉ('\u0150', 257, 12), new ぉ('\u014F', 224, 8), new ぉ('\u014E', 255, 8),
            new ぉ('\u014D', 222, 7), new ぉ('\u014C', 253, 7), new ぉ('\u0148', 218, 11), new ぉ('\u0147', 249, 11),
            new ぉ('\u0146', 216, 6), new ぉ('\u0145', 247, 6), new ぉ('\u0144', 214, 1), new ぉ('\u0143', 245, 1),
            new ぉ('\u013E', 210, 11), new ぉ('\u013D', 241, 11), new ぉ('\u013C', 208, 6), new ぉ('\u013B', 239, 6),
            new ぉ('\u013A', 206, 1), new ぉ('\u0139', 237, 1), new ぉ('\u0137', 204, 6), new ぉ('\u0136', 235, 6),
            new ぉ('\u0135', 203, 2), new ぉ('\u0134', 234, 2), new ぉ('\u0130', 231, 10), new ぉ('\u012F', 198, 9),
            new ぉ('\u012E', 229, 9), new ぉ('\u012D', 196, 8), new ぉ('\u012C', 227, 8), new ぉ('\u012B', 194, 7),
            new ぉ('\u012A', 225, 7), new ぉ('\u0129', 192, 3), new ぉ('\u0128', 223, 3), new ぉ('\u0125', 189, 2),
            new ぉ('\u0124', 220, 2), new ぉ('\u0123', 188, 6), new ぉ('\u0122', 219, 6), new ぉ('\u0121', 186, 10),
            new ぉ('\u0120', 217, 10), new ぉ('\u011F', 184, 8), new ぉ('\u011E', 215, 8), new ぉ('\u011D', 182, 2),
            new ぉ('\u011C', 213, 2), new ぉ('\u011B', 182, 11), new ぉ('\u011A', 213, 11), new ぉ('\u0119', 180, 9),
            new ぉ('\u0118', 211, 9), new ぉ('\u0117', 178, 10), new ぉ('\u0116', 209, 10), new ぉ('\u0115', 176, 8),
            new ぉ('\u0114', 207, 8), new ぉ('\u0113', 174, 7), new ぉ('\u0112', 205, 7), new ぉ('\u010F', 171, 11),
            new ぉ('\u010E', 202, 11), new ぉ('\u010D', 170, 11), new ぉ('\u010C', 201, 11), new ぉ('\u010B', 168, 10),
            new ぉ('\u010A', 199, 10), new ぉ('\u0109', 166, 2), new ぉ('\u0108', 197, 2), new ぉ('\u0107', 164, 1),
            new ぉ('\u0106', 195, 1), new ぉ('\u0105', 164, 9), new ぉ('\u0104', 195, 9), new ぉ('\u0103', 162, 8),
            new ぉ('\u0102', 193, 8), new ぉ('\u0101', 160, 7), new ぉ('\u0100', 191, 7), new ぉ('\u00FF', 134, 4),
            new ぉ('\u00FD', 132, 1), new ぉ('\u00FC', 135, 4), new ぉ('\u00FB', 134, 2), new ぉ('\u00FA', 133, 1),
            new ぉ('\u00F9', 132, 0), new ぉ('\u00F6', 135, 4), new ぉ('\u00F5', 134, 3), new ぉ('\u00F4', 133, 2),
            new ぉ('\u00F3', 132, 1), new ぉ('\u00F2', 131, 0), new ぉ('\u00F1', 131, 3), new ぉ('\u00EF', 134, 4),
            new ぉ('\u00EE', 133, 2), new ぉ('\u00ED', 132, 1), new ぉ('\u00EC', 131, 0), new ぉ('\u00EB', 134, 4),
            new ぉ('\u00EA', 133, 2), new ぉ('\u00E9', 132, 1), new ぉ('\u00E8', 131, 0), new ぉ('\u00E7', 132, 6),
            new ぉ('\u00E5', 132, 5), new ぉ('\u00E4', 131, 4), new ぉ('\u00E3', 130, 3), new ぉ('\u00E2', 129, 2),
            new ぉ('\u00E1', 128, 1), new ぉ('\u00E0', 127, 0), new ぉ('\u00DD', 132, 1), new ぉ('\u00DC', 135, 4),
            new ぉ('\u00DB', 134, 2), new ぉ('\u00DA', 133, 1), new ぉ('\u00D9', 132, 0), new ぉ('\u00D6', 135, 4),
            new ぉ('\u00D5', 134, 3), new ぉ('\u00D4', 133, 2), new ぉ('\u00D3', 132, 1), new ぉ('\u00D2', 131, 0),
            new ぉ('\u00D1', 131, 3), new ぉ('\u00CF', 134, 4), new ぉ('\u00CE', 133, 2), new ぉ('\u00CD', 132, 1),
            new ぉ('\u00CC', 131, 0), new ぉ('\u00CB', 134, 4), new ぉ('\u00CA', 133, 2), new ぉ('\u00C9', 132, 1),
            new ぉ('\u00C8', 131, 0), new ぉ('\u00C7', 132, 6), new ぉ('\u00C5', 132, 5), new ぉ('\u00C4', 131, 4),
            new ぉ('\u00C3', 130, 3), new ぉ('\u00C2', 129, 2), new ぉ('\u00C1', 128, 1), new ぉ('\u00C0', 127, 0),
        };
        internal static readonly Dictionary<char, ぉ> むあすつ = new Dictionary<char, ぉ>{
            {'\uFAD7', new ぉ('\uFAD7', 74360, 97)}, {'\uFAD6', new ぉ('\uFAD6', 74367, 96)}, {'\uFAD5', new ぉ('\uFAD5', 74369, 95)}, {'\uFAD1', new ぉ('\uFAD1', 74373, 94)},
            {'\uFAD0', new ぉ('\uFAD0', 74374, 93)}, {'\uFACF', new ぉ('\uFACF', 74373, 92)}, {'\uFA6C', new ぉ('\uFA6C', 74268, 91)}, {'\u2ADC', new ぉ('\u2ADC', 65535, 90)},
            {'\u22ED', new ぉ('\u22ED', 65592, 90)}, {'\u22EC', new ぉ('\u22EC', 65592, 90)}, {'\u22EB', new ぉ('\u22EB', 65592, 90)}, {'\u22EA', new ぉ('\u22EA', 65592, 90)},
            {'\u22E3', new ぉ('\u22E3', 65617, 90)}, {'\u22E2', new ぉ('\u22E2', 65617, 90)}, {'\u22E1', new ぉ('\u22E1', 65636, 90)}, {'\u22E0', new ぉ('\u22E0', 65636, 90)},
            {'\u22AF', new ぉ('\u22AF', 65540, 90)}, {'\u22AE', new ぉ('\u22AE', 65541, 90)}, {'\u22AD', new ぉ('\u22AD', 65541, 90)}, {'\u22AC', new ぉ('\u22AC', 65546, 90)},
            {'\u2289', new ぉ('\u2289', 65538, 90)}, {'\u2288', new ぉ('\u2288', 65538, 90)}, {'\u2285', new ぉ('\u2285', 65538, 90)}, {'\u2284', new ぉ('\u2284', 65538, 90)},
            {'\u2281', new ぉ('\u2281', 65542, 90)}, {'\u2280', new ぉ('\u2280', 65542, 90)}, {'\u2279', new ぉ('\u2279', 65538, 90)}, {'\u2278', new ぉ('\u2278', 65538, 90)},
            {'\u2275', new ぉ('\u2275', 65538, 90)}, {'\u2274', new ぉ('\u2274', 65538, 90)}, {'\u2271', new ぉ('\u2271', 65548, 90)}, {'\u2270', new ぉ('\u2270', 65548, 90)},
            {'\u226F', new ぉ('\u226F', 74289, 90)}, {'\u226E', new ぉ('\u226E', 74290, 90)}, {'\u226D', new ぉ('\u226D', 65568, 90)}, {'\u2262', new ぉ('\u2262', 65537, 90)},
            {'\u2260', new ぉ('\u2260', 74275, 90)}, {'\u2249', new ぉ('\u2249', 65537, 90)}, {'\u2247', new ぉ('\u2247', 65538, 90)}, {'\u2244', new ぉ('\u2244', 65537, 90)},
            {'\u2241', new ぉ('\u2241', 65541, 90)}, {'\u2226', new ぉ('\u2226', 65537, 90)}, {'\u2224', new ぉ('\u2224', 65537, 90)}, {'\u220C', new ぉ('\u220C', 65537, 90)},
            {'\u2209', new ぉ('\u2209', 65537, 90)}, {'\u2204', new ぉ('\u2204', 65537, 90)}, {'\u21CF', new ぉ('\u21CF', 65533, 90)}, {'\u21CE', new ぉ('\u21CE', 65530, 90)},
            {'\u21CD', new ぉ('\u21CD', 65533, 90)}, {'\u21AE', new ぉ('\u21AE', 65562, 90)}, {'\u219B', new ぉ('\u219B', 65545, 90)}, {'\u219A', new ぉ('\u219A', 65546, 90)},
            {'\u212B', new ぉ('\u212B', 73962, 5)}, {'\uFB4E', new ぉ('\uFB4E', 62826, 89)}, {'\uFB4D', new ぉ('\uFB4D', 62834, 89)}, {'\uFB4C', new ぉ('\uFB4C', 62843, 89)},
            {'\uFB4B', new ぉ('\uFB4B', 62838, 88)}, {'\uFB4A', new ぉ('\uFB4A', 62816, 87)}, {'\uFB49', new ぉ('\uFB49', 62816, 87)}, {'\uFB48', new ぉ('\uFB48', 62816, 87)},
            {'\uFB47', new ぉ('\uFB47', 62816, 87)}, {'\uFB46', new ぉ('\uFB46', 62816, 87)}, {'\uFB44', new ぉ('\uFB44', 62816, 87)}, {'\uFB43', new ぉ('\uFB43', 62816, 87)},
            {'\uFB41', new ぉ('\uFB41', 62816, 87)}, {'\uFB40', new ぉ('\uFB40', 62816, 87)}, {'\uFB3E', new ぉ('\uFB3E', 62816, 87)}, {'\uFB3C', new ぉ('\uFB3C', 62816, 87)},
            {'\uFB3B', new ぉ('\uFB3B', 62816, 87)}, {'\uFB3A', new ぉ('\uFB3A', 62816, 87)}, {'\uFB39', new ぉ('\uFB39', 62816, 87)}, {'\uFB38', new ぉ('\uFB38', 62816, 87)},
            {'\uFB36', new ぉ('\uFB36', 62816, 87)}, {'\uFB35', new ぉ('\uFB35', 62816, 87)}, {'\uFB34', new ぉ('\uFB34', 62816, 87)}, {'\uFB33', new ぉ('\uFB33', 62816, 87)},
            {'\uFB32', new ぉ('\uFB32', 62816, 87)}, {'\uFB31', new ぉ('\uFB31', 62816, 87)}, {'\uFB30', new ぉ('\uFB30', 62816, 87)}, {'\uFB2F', new ぉ('\uFB2F', 62815, 86)},
            {'\uFB2E', new ぉ('\uFB2E', 62814, 83)}, {'\uFB2B', new ぉ('\uFB2B', 62786, 85)}, {'\uFB2A', new ぉ('\uFB2A', 62785, 84)}, {'\uFB1F', new ぉ('\uFB1F', 62765, 83)},
            {'\uFB1D', new ぉ('\uFB1D', 62788, 82)}, {'\uD788', new ぉ('\uD788', 50806, 81)}, {'\uD76C', new ぉ('\uD76C', 50778, 80)}, {'\uD750', new ぉ('\uD750', 50750, 79)},
            {'\uD734', new ぉ('\uD734', 50722, 78)}, {'\uD718', new ぉ('\uD718', 50694, 77)}, {'\uD6FC', new ぉ('\uD6FC', 50666, 76)}, {'\uD6E0', new ぉ('\uD6E0', 50638, 75)},
            {'\uD6C4', new ぉ('\uD6C4', 50610, 74)}, {'\uD6A8', new ぉ('\uD6A8', 50582, 73)}, {'\uD68C', new ぉ('\uD68C', 50554, 72)}, {'\uD670', new ぉ('\uD670', 50526, 71)},
            {'\uD654', new ぉ('\uD654', 50498, 70)}, {'\uD638', new ぉ('\uD638', 50470, 69)}, {'\uD61C', new ぉ('\uD61C', 50442, 68)}, {'\uD600', new ぉ('\uD600', 50414, 67)},
            {'\uD5E4', new ぉ('\uD5E4', 50386, 66)}, {'\uD5C8', new ぉ('\uD5C8', 50358, 65)}, {'\uD5AC', new ぉ('\uD5AC', 50330, 64)}, {'\uD590', new ぉ('\uD590', 50302, 63)},
            {'\uD574', new ぉ('\uD574', 50274, 62)}, {'\uD558', new ぉ('\uD558', 50246, 61)}, {'\uD53C', new ぉ('\uD53C', 50219, 81)}, {'\uD520', new ぉ('\uD520', 50191, 80)},
            {'\uD504', new ぉ('\uD504', 50163, 79)}, {'\uD4E8', new ぉ('\uD4E8', 50135, 78)}, {'\uD4CC', new ぉ('\uD4CC', 50107, 77)}, {'\uD4B0', new ぉ('\uD4B0', 50079, 76)},
            {'\uD494', new ぉ('\uD494', 50051, 75)}, {'\uD478', new ぉ('\uD478', 50023, 74)}, {'\uD45C', new ぉ('\uD45C', 49995, 73)}, {'\uD440', new ぉ('\uD440', 49967, 72)},
            {'\uD424', new ぉ('\uD424', 49939, 71)}, {'\uD408', new ぉ('\uD408', 49911, 70)}, {'\uD3EC', new ぉ('\uD3EC', 49883, 69)}, {'\uD3D0', new ぉ('\uD3D0', 49855, 68)},
            {'\uD3B4', new ぉ('\uD3B4', 49827, 67)}, {'\uD398', new ぉ('\uD398', 49799, 66)}, {'\uD37C', new ぉ('\uD37C', 49771, 65)}, {'\uD360', new ぉ('\uD360', 49743, 64)},
            {'\uD344', new ぉ('\uD344', 49715, 63)}, {'\uD328', new ぉ('\uD328', 49687, 62)}, {'\uD30C', new ぉ('\uD30C', 49659, 61)}, {'\uD2F0', new ぉ('\uD2F0', 49632, 81)},
            {'\uD2D4', new ぉ('\uD2D4', 49604, 80)}, {'\uD2B8', new ぉ('\uD2B8', 49576, 79)}, {'\uD29C', new ぉ('\uD29C', 49548, 78)}, {'\uD280', new ぉ('\uD280', 49520, 77)},
            {'\uD264', new ぉ('\uD264', 49492, 76)}, {'\uD248', new ぉ('\uD248', 49464, 75)}, {'\uD22C', new ぉ('\uD22C', 49436, 74)}, {'\uD210', new ぉ('\uD210', 49408, 73)},
            {'\uD1F4', new ぉ('\uD1F4', 49380, 72)}, {'\uD1D8', new ぉ('\uD1D8', 49352, 71)}, {'\uD1BC', new ぉ('\uD1BC', 49324, 70)}, {'\uD1A0', new ぉ('\uD1A0', 49296, 69)},
            {'\uD184', new ぉ('\uD184', 49268, 68)}, {'\uD168', new ぉ('\uD168', 49240, 67)}, {'\uD14C', new ぉ('\uD14C', 49212, 66)}, {'\uD130', new ぉ('\uD130', 49184, 65)},
            {'\uD114', new ぉ('\uD114', 49156, 64)}, {'\uD0F8', new ぉ('\uD0F8', 49128, 63)}, {'\uD0DC', new ぉ('\uD0DC', 49100, 62)}, {'\uD0C0', new ぉ('\uD0C0', 49072, 61)},
            {'\uD0A4', new ぉ('\uD0A4', 49045, 81)}, {'\uD088', new ぉ('\uD088', 49017, 80)}, {'\uD06C', new ぉ('\uD06C', 48989, 79)}, {'\uD050', new ぉ('\uD050', 48961, 78)},
            {'\uD034', new ぉ('\uD034', 48933, 77)}, {'\uD018', new ぉ('\uD018', 48905, 76)}, {'\uCFFC', new ぉ('\uCFFC', 48877, 75)}, {'\uCFE0', new ぉ('\uCFE0', 48849, 74)},
            {'\uCFC4', new ぉ('\uCFC4', 48821, 73)}, {'\uCFA8', new ぉ('\uCFA8', 48793, 72)}, {'\uCF8C', new ぉ('\uCF8C', 48765, 71)}, {'\uCF70', new ぉ('\uCF70', 48737, 70)},
            {'\uCF54', new ぉ('\uCF54', 48709, 69)}, {'\uCF38', new ぉ('\uCF38', 48681, 68)}, {'\uCF1C', new ぉ('\uCF1C', 48653, 67)}, {'\uCF00', new ぉ('\uCF00', 48625, 66)},
            {'\uCEE4', new ぉ('\uCEE4', 48597, 65)}, {'\uCEC8', new ぉ('\uCEC8', 48569, 64)}, {'\uCEAC', new ぉ('\uCEAC', 48541, 63)}, {'\uCE90', new ぉ('\uCE90', 48513, 62)},
            {'\uCE74', new ぉ('\uCE74', 48485, 61)}, {'\uCE58', new ぉ('\uCE58', 48458, 81)}, {'\uCE3C', new ぉ('\uCE3C', 48430, 80)}, {'\uCE20', new ぉ('\uCE20', 48402, 79)},
            {'\uCE04', new ぉ('\uCE04', 48374, 78)}, {'\uCDE8', new ぉ('\uCDE8', 48346, 77)}, {'\uCDCC', new ぉ('\uCDCC', 48318, 76)}, {'\uCDB0', new ぉ('\uCDB0', 48290, 75)},
            {'\uCD94', new ぉ('\uCD94', 48262, 74)}, {'\uCD78', new ぉ('\uCD78', 48234, 73)}, {'\uCD5C', new ぉ('\uCD5C', 48206, 72)}, {'\uCD40', new ぉ('\uCD40', 48178, 71)},
            {'\uCD24', new ぉ('\uCD24', 48150, 70)}, {'\uCD08', new ぉ('\uCD08', 48122, 69)}, {'\uCCEC', new ぉ('\uCCEC', 48094, 68)}, {'\uCCD0', new ぉ('\uCCD0', 48066, 67)},
            {'\uCCB4', new ぉ('\uCCB4', 48038, 66)}, {'\uCC98', new ぉ('\uCC98', 48010, 65)}, {'\uCC7C', new ぉ('\uCC7C', 47982, 64)}, {'\uCC60', new ぉ('\uCC60', 47954, 63)},
            {'\uCC44', new ぉ('\uCC44', 47926, 62)}, {'\uCC28', new ぉ('\uCC28', 47898, 61)}, {'\uCC0C', new ぉ('\uCC0C', 47871, 81)}, {'\uCBF0', new ぉ('\uCBF0', 47843, 80)},
            {'\uCBD4', new ぉ('\uCBD4', 47815, 79)}, {'\uCBB8', new ぉ('\uCBB8', 47787, 78)}, {'\uCB9C', new ぉ('\uCB9C', 47759, 77)}, {'\uCB80', new ぉ('\uCB80', 47731, 76)},
            {'\uCB64', new ぉ('\uCB64', 47703, 75)}, {'\uCB48', new ぉ('\uCB48', 47675, 74)}, {'\uCB2C', new ぉ('\uCB2C', 47647, 73)}, {'\uCB10', new ぉ('\uCB10', 47619, 72)},
            {'\uCAF4', new ぉ('\uCAF4', 47591, 71)}, {'\uCAD8', new ぉ('\uCAD8', 47563, 70)}, {'\uCABC', new ぉ('\uCABC', 47535, 69)}, {'\uCAA0', new ぉ('\uCAA0', 47507, 68)},
            {'\uCA84', new ぉ('\uCA84', 47479, 67)}, {'\uCA68', new ぉ('\uCA68', 47451, 66)}, {'\uCA4C', new ぉ('\uCA4C', 47423, 65)}, {'\uCA30', new ぉ('\uCA30', 47395, 64)},
            {'\uCA14', new ぉ('\uCA14', 47367, 63)}, {'\uC9F8', new ぉ('\uC9F8', 47339, 62)}, {'\uC9DC', new ぉ('\uC9DC', 47311, 61)}, {'\uC9C0', new ぉ('\uC9C0', 47284, 81)},
            {'\uC9A4', new ぉ('\uC9A4', 47256, 80)}, {'\uC988', new ぉ('\uC988', 47228, 79)}, {'\uC96C', new ぉ('\uC96C', 47200, 78)}, {'\uC950', new ぉ('\uC950', 47172, 77)},
            {'\uC934', new ぉ('\uC934', 47144, 76)}, {'\uC918', new ぉ('\uC918', 47116, 75)}, {'\uC8FC', new ぉ('\uC8FC', 47088, 74)}, {'\uC8E0', new ぉ('\uC8E0', 47060, 73)},
            {'\uC8C4', new ぉ('\uC8C4', 47032, 72)}, {'\uC8A8', new ぉ('\uC8A8', 47004, 71)}, {'\uC88C', new ぉ('\uC88C', 46976, 70)}, {'\uC870', new ぉ('\uC870', 46948, 69)},
            {'\uC854', new ぉ('\uC854', 46920, 68)}, {'\uC838', new ぉ('\uC838', 46892, 67)}, {'\uC81C', new ぉ('\uC81C', 46864, 66)}, {'\uC800', new ぉ('\uC800', 46836, 65)},
            {'\uC7E4', new ぉ('\uC7E4', 46808, 64)}, {'\uC7C8', new ぉ('\uC7C8', 46780, 63)}, {'\uC7AC', new ぉ('\uC7AC', 46752, 62)}, {'\uC790', new ぉ('\uC790', 46724, 61)},
            {'\uC774', new ぉ('\uC774', 46697, 81)}, {'\uC758', new ぉ('\uC758', 46669, 80)}, {'\uC73C', new ぉ('\uC73C', 46641, 79)}, {'\uC720', new ぉ('\uC720', 46613, 78)},
            {'\uC704', new ぉ('\uC704', 46585, 77)}, {'\uC6E8', new ぉ('\uC6E8', 46557, 76)}, {'\uC6CC', new ぉ('\uC6CC', 46529, 75)}, {'\uC6B0', new ぉ('\uC6B0', 46501, 74)},
            {'\uC694', new ぉ('\uC694', 46473, 73)}, {'\uC678', new ぉ('\uC678', 46445, 72)}, {'\uC65C', new ぉ('\uC65C', 46417, 71)}, {'\uC640', new ぉ('\uC640', 46389, 70)},
            {'\uC624', new ぉ('\uC624', 46361, 69)}, {'\uC608', new ぉ('\uC608', 46333, 68)}, {'\uC5EC', new ぉ('\uC5EC', 46305, 67)}, {'\uC5D0', new ぉ('\uC5D0', 46277, 66)},
            {'\uC5B4', new ぉ('\uC5B4', 46249, 65)}, {'\uC598', new ぉ('\uC598', 46221, 64)}, {'\uC57C', new ぉ('\uC57C', 46193, 63)}, {'\uC560', new ぉ('\uC560', 46165, 62)},
            {'\uC544', new ぉ('\uC544', 46137, 61)}, {'\uC528', new ぉ('\uC528', 46110, 81)}, {'\uC50C', new ぉ('\uC50C', 46082, 80)}, {'\uC4F0', new ぉ('\uC4F0', 46054, 79)},
            {'\uC4D4', new ぉ('\uC4D4', 46026, 78)}, {'\uC4B8', new ぉ('\uC4B8', 45998, 77)}, {'\uC49C', new ぉ('\uC49C', 45970, 76)}, {'\uC480', new ぉ('\uC480', 45942, 75)},
            {'\uC464', new ぉ('\uC464', 45914, 74)}, {'\uC448', new ぉ('\uC448', 45886, 73)}, {'\uC42C', new ぉ('\uC42C', 45858, 72)}, {'\uC410', new ぉ('\uC410', 45830, 71)},
            {'\uC3F4', new ぉ('\uC3F4', 45802, 70)}, {'\uC3D8', new ぉ('\uC3D8', 45774, 69)}, {'\uC3BC', new ぉ('\uC3BC', 45746, 68)}, {'\uC3A0', new ぉ('\uC3A0', 45718, 67)},
            {'\uC384', new ぉ('\uC384', 45690, 66)}, {'\uC368', new ぉ('\uC368', 45662, 65)}, {'\uC34C', new ぉ('\uC34C', 45634, 64)}, {'\uC330', new ぉ('\uC330', 45606, 63)},
            {'\uC314', new ぉ('\uC314', 45578, 62)}, {'\uC2F8', new ぉ('\uC2F8', 45550, 61)}, {'\uC2DC', new ぉ('\uC2DC', 45523, 81)}, {'\uC2C0', new ぉ('\uC2C0', 45495, 80)},
            {'\uC2A4', new ぉ('\uC2A4', 45467, 79)}, {'\uC288', new ぉ('\uC288', 45439, 78)}, {'\uC26C', new ぉ('\uC26C', 45411, 77)}, {'\uC250', new ぉ('\uC250', 45383, 76)},
            {'\uC234', new ぉ('\uC234', 45355, 75)}, {'\uC218', new ぉ('\uC218', 45327, 74)}, {'\uC1FC', new ぉ('\uC1FC', 45299, 73)}, {'\uC1E0', new ぉ('\uC1E0', 45271, 72)},
            {'\uC1C4', new ぉ('\uC1C4', 45243, 71)}, {'\uC1A8', new ぉ('\uC1A8', 45215, 70)}, {'\uC18C', new ぉ('\uC18C', 45187, 69)}, {'\uC170', new ぉ('\uC170', 45159, 68)},
            {'\uC154', new ぉ('\uC154', 45131, 67)}, {'\uC138', new ぉ('\uC138', 45103, 66)}, {'\uC11C', new ぉ('\uC11C', 45075, 65)}, {'\uC100', new ぉ('\uC100', 45047, 64)},
            {'\uC0E4', new ぉ('\uC0E4', 45019, 63)}, {'\uC0C8', new ぉ('\uC0C8', 44991, 62)}, {'\uC0AC', new ぉ('\uC0AC', 44963, 61)}, {'\uC090', new ぉ('\uC090', 44936, 81)},
            {'\uC074', new ぉ('\uC074', 44908, 80)}, {'\uC058', new ぉ('\uC058', 44880, 79)}, {'\uC03C', new ぉ('\uC03C', 44852, 78)}, {'\uC020', new ぉ('\uC020', 44824, 77)},
            {'\uC004', new ぉ('\uC004', 44796, 76)}, {'\uBFE8', new ぉ('\uBFE8', 44768, 75)}, {'\uBFCC', new ぉ('\uBFCC', 44740, 74)}, {'\uBFB0', new ぉ('\uBFB0', 44712, 73)},
            {'\uBF94', new ぉ('\uBF94', 44684, 72)}, {'\uBF78', new ぉ('\uBF78', 44656, 71)}, {'\uBF5C', new ぉ('\uBF5C', 44628, 70)}, {'\uBF40', new ぉ('\uBF40', 44600, 69)},
            {'\uBF24', new ぉ('\uBF24', 44572, 68)}, {'\uBF08', new ぉ('\uBF08', 44544, 67)}, {'\uBEEC', new ぉ('\uBEEC', 44516, 66)}, {'\uBED0', new ぉ('\uBED0', 44488, 65)},
            {'\uBEB4', new ぉ('\uBEB4', 44460, 64)}, {'\uBE98', new ぉ('\uBE98', 44432, 63)}, {'\uBE7C', new ぉ('\uBE7C', 44404, 62)}, {'\uBE60', new ぉ('\uBE60', 44376, 61)},
            {'\uBE44', new ぉ('\uBE44', 44349, 81)}, {'\uBE28', new ぉ('\uBE28', 44321, 80)}, {'\uBE0C', new ぉ('\uBE0C', 44293, 79)}, {'\uBDF0', new ぉ('\uBDF0', 44265, 78)},
            {'\uBDD4', new ぉ('\uBDD4', 44237, 77)}, {'\uBDB8', new ぉ('\uBDB8', 44209, 76)}, {'\uBD9C', new ぉ('\uBD9C', 44181, 75)}, {'\uBD80', new ぉ('\uBD80', 44153, 74)},
            {'\uBD64', new ぉ('\uBD64', 44125, 73)}, {'\uBD48', new ぉ('\uBD48', 44097, 72)}, {'\uBD2C', new ぉ('\uBD2C', 44069, 71)}, {'\uBD10', new ぉ('\uBD10', 44041, 70)},
            {'\uBCF4', new ぉ('\uBCF4', 44013, 69)}, {'\uBCD8', new ぉ('\uBCD8', 43985, 68)}, {'\uBCBC', new ぉ('\uBCBC', 43957, 67)}, {'\uBCA0', new ぉ('\uBCA0', 43929, 66)},
            {'\uBC84', new ぉ('\uBC84', 43901, 65)}, {'\uBC68', new ぉ('\uBC68', 43873, 64)}, {'\uBC4C', new ぉ('\uBC4C', 43845, 63)}, {'\uBC30', new ぉ('\uBC30', 43817, 62)},
            {'\uBC14', new ぉ('\uBC14', 43789, 61)}, {'\uBBF8', new ぉ('\uBBF8', 43762, 81)}, {'\uBBDC', new ぉ('\uBBDC', 43734, 80)}, {'\uBBC0', new ぉ('\uBBC0', 43706, 79)},
            {'\uBBA4', new ぉ('\uBBA4', 43678, 78)}, {'\uBB88', new ぉ('\uBB88', 43650, 77)}, {'\uBB6C', new ぉ('\uBB6C', 43622, 76)}, {'\uBB50', new ぉ('\uBB50', 43594, 75)},
            {'\uBB34', new ぉ('\uBB34', 43566, 74)}, {'\uBB18', new ぉ('\uBB18', 43538, 73)}, {'\uBAFC', new ぉ('\uBAFC', 43510, 72)}, {'\uBAE0', new ぉ('\uBAE0', 43482, 71)},
            {'\uBAC4', new ぉ('\uBAC4', 43454, 70)}, {'\uBAA8', new ぉ('\uBAA8', 43426, 69)}, {'\uBA8C', new ぉ('\uBA8C', 43398, 68)}, {'\uBA70', new ぉ('\uBA70', 43370, 67)},
            {'\uBA54', new ぉ('\uBA54', 43342, 66)}, {'\uBA38', new ぉ('\uBA38', 43314, 65)}, {'\uBA1C', new ぉ('\uBA1C', 43286, 64)}, {'\uBA00', new ぉ('\uBA00', 43258, 63)},
            {'\uB9E4', new ぉ('\uB9E4', 43230, 62)}, {'\uB9C8', new ぉ('\uB9C8', 43202, 61)}, {'\uB9AC', new ぉ('\uB9AC', 43175, 81)}, {'\uB990', new ぉ('\uB990', 43147, 80)},
            {'\uB974', new ぉ('\uB974', 43119, 79)}, {'\uB958', new ぉ('\uB958', 43091, 78)}, {'\uB93C', new ぉ('\uB93C', 43063, 77)}, {'\uB920', new ぉ('\uB920', 43035, 76)},
            {'\uB904', new ぉ('\uB904', 43007, 75)}, {'\uB8E8', new ぉ('\uB8E8', 42979, 74)}, {'\uB8CC', new ぉ('\uB8CC', 42951, 73)}, {'\uB8B0', new ぉ('\uB8B0', 42923, 72)},
            {'\uB894', new ぉ('\uB894', 42895, 71)}, {'\uB878', new ぉ('\uB878', 42867, 70)}, {'\uB85C', new ぉ('\uB85C', 42839, 69)}, {'\uB840', new ぉ('\uB840', 42811, 68)},
            {'\uB824', new ぉ('\uB824', 42783, 67)}, {'\uB808', new ぉ('\uB808', 42755, 66)}, {'\uB7EC', new ぉ('\uB7EC', 42727, 65)}, {'\uB7D0', new ぉ('\uB7D0', 42699, 64)},
            {'\uB7B4', new ぉ('\uB7B4', 42671, 63)}, {'\uB798', new ぉ('\uB798', 42643, 62)}, {'\uB77C', new ぉ('\uB77C', 42615, 61)}, {'\uB760', new ぉ('\uB760', 42588, 81)},
            {'\uB744', new ぉ('\uB744', 42560, 80)}, {'\uB728', new ぉ('\uB728', 42532, 79)}, {'\uB70C', new ぉ('\uB70C', 42504, 78)}, {'\uB6F0', new ぉ('\uB6F0', 42476, 77)},
            {'\uB6D4', new ぉ('\uB6D4', 42448, 76)}, {'\uB6B8', new ぉ('\uB6B8', 42420, 75)}, {'\uB69C', new ぉ('\uB69C', 42392, 74)}, {'\uB680', new ぉ('\uB680', 42364, 73)},
            {'\uB664', new ぉ('\uB664', 42336, 72)}, {'\uB648', new ぉ('\uB648', 42308, 71)}, {'\uB62C', new ぉ('\uB62C', 42280, 70)}, {'\uB610', new ぉ('\uB610', 42252, 69)},
            {'\uB5F4', new ぉ('\uB5F4', 42224, 68)}, {'\uB5D8', new ぉ('\uB5D8', 42196, 67)}, {'\uB5BC', new ぉ('\uB5BC', 42168, 66)}, {'\uB5A0', new ぉ('\uB5A0', 42140, 65)},
            {'\uB584', new ぉ('\uB584', 42112, 64)}, {'\uB568', new ぉ('\uB568', 42084, 63)}, {'\uB54C', new ぉ('\uB54C', 42056, 62)}, {'\uB530', new ぉ('\uB530', 42028, 61)},
            {'\uB514', new ぉ('\uB514', 42001, 81)}, {'\uB4F8', new ぉ('\uB4F8', 41973, 80)}, {'\uB4DC', new ぉ('\uB4DC', 41945, 79)}, {'\uB4C0', new ぉ('\uB4C0', 41917, 78)},
            {'\uB4A4', new ぉ('\uB4A4', 41889, 77)}, {'\uB488', new ぉ('\uB488', 41861, 76)}, {'\uB46C', new ぉ('\uB46C', 41833, 75)}, {'\uB450', new ぉ('\uB450', 41805, 74)},
            {'\uB434', new ぉ('\uB434', 41777, 73)}, {'\uB418', new ぉ('\uB418', 41749, 72)}, {'\uB3FC', new ぉ('\uB3FC', 41721, 71)}, {'\uB3E0', new ぉ('\uB3E0', 41693, 70)},
            {'\uB3C4', new ぉ('\uB3C4', 41665, 69)}, {'\uB3A8', new ぉ('\uB3A8', 41637, 68)}, {'\uB38C', new ぉ('\uB38C', 41609, 67)}, {'\uB370', new ぉ('\uB370', 41581, 66)},
            {'\uB354', new ぉ('\uB354', 41553, 65)}, {'\uB338', new ぉ('\uB338', 41525, 64)}, {'\uB31C', new ぉ('\uB31C', 41497, 63)}, {'\uB300', new ぉ('\uB300', 41469, 62)},
            {'\uB2E4', new ぉ('\uB2E4', 41441, 61)}, {'\uB2C8', new ぉ('\uB2C8', 41414, 81)}, {'\uB2AC', new ぉ('\uB2AC', 41386, 80)}, {'\uB290', new ぉ('\uB290', 41358, 79)},
            {'\uB274', new ぉ('\uB274', 41330, 78)}, {'\uB258', new ぉ('\uB258', 41302, 77)}, {'\uB23C', new ぉ('\uB23C', 41274, 76)}, {'\uB220', new ぉ('\uB220', 41246, 75)},
            {'\uB204', new ぉ('\uB204', 41218, 74)}, {'\uB1E8', new ぉ('\uB1E8', 41190, 73)}, {'\uB1CC', new ぉ('\uB1CC', 41162, 72)}, {'\uB1B0', new ぉ('\uB1B0', 41134, 71)},
            {'\uB194', new ぉ('\uB194', 41106, 70)}, {'\uB178', new ぉ('\uB178', 41078, 69)}, {'\uB15C', new ぉ('\uB15C', 41050, 68)}, {'\uB140', new ぉ('\uB140', 41022, 67)},
            {'\uB124', new ぉ('\uB124', 40994, 66)}, {'\uB108', new ぉ('\uB108', 40966, 65)}, {'\uB0EC', new ぉ('\uB0EC', 40938, 64)}, {'\uB0D0', new ぉ('\uB0D0', 40910, 63)},
            {'\uB0B4', new ぉ('\uB0B4', 40882, 62)}, {'\uB098', new ぉ('\uB098', 40854, 61)}, {'\uB07C', new ぉ('\uB07C', 40827, 81)}, {'\uB060', new ぉ('\uB060', 40799, 80)},
            {'\uB044', new ぉ('\uB044', 40771, 79)}, {'\uB028', new ぉ('\uB028', 40743, 78)}, {'\uB00C', new ぉ('\uB00C', 40715, 77)}, {'\uAFF0', new ぉ('\uAFF0', 40687, 76)},
            {'\uAFD4', new ぉ('\uAFD4', 40659, 75)}, {'\uAFB8', new ぉ('\uAFB8', 40631, 74)}, {'\uAF9C', new ぉ('\uAF9C', 40603, 73)}, {'\uAF80', new ぉ('\uAF80', 40575, 72)},
            {'\uAF64', new ぉ('\uAF64', 40547, 71)}, {'\uAF48', new ぉ('\uAF48', 40519, 70)}, {'\uAF2C', new ぉ('\uAF2C', 40491, 69)}, {'\uAF10', new ぉ('\uAF10', 40463, 68)},
            {'\uAEF4', new ぉ('\uAEF4', 40435, 67)}, {'\uAED8', new ぉ('\uAED8', 40407, 66)}, {'\uAEBC', new ぉ('\uAEBC', 40379, 65)}, {'\uAEA0', new ぉ('\uAEA0', 40351, 64)},
            {'\uAE84', new ぉ('\uAE84', 40323, 63)}, {'\uAE68', new ぉ('\uAE68', 40295, 62)}, {'\uAE4C', new ぉ('\uAE4C', 40267, 61)}, {'\uAE30', new ぉ('\uAE30', 40240, 81)},
            {'\uAE14', new ぉ('\uAE14', 40212, 80)}, {'\uADF8', new ぉ('\uADF8', 40184, 79)}, {'\uADDC', new ぉ('\uADDC', 40156, 78)}, {'\uADC0', new ぉ('\uADC0', 40128, 77)},
            {'\uADA4', new ぉ('\uADA4', 40100, 76)}, {'\uAD88', new ぉ('\uAD88', 40072, 75)}, {'\uAD6C', new ぉ('\uAD6C', 40044, 74)}, {'\uAD50', new ぉ('\uAD50', 40016, 73)},
            {'\uAD34', new ぉ('\uAD34', 39988, 72)}, {'\uAD18', new ぉ('\uAD18', 39960, 71)}, {'\uACFC', new ぉ('\uACFC', 39932, 70)}, {'\uACE0', new ぉ('\uACE0', 39904, 69)},
            {'\uACC4', new ぉ('\uACC4', 39876, 68)}, {'\uACA8', new ぉ('\uACA8', 39848, 67)}, {'\uAC8C', new ぉ('\uAC8C', 39820, 66)}, {'\uAC70', new ぉ('\uAC70', 39792, 65)},
            {'\uAC54', new ぉ('\uAC54', 39764, 64)}, {'\uAC38', new ぉ('\uAC38', 39736, 63)}, {'\uAC1C', new ぉ('\uAC1C', 39708, 62)}, {'\uAC00', new ぉ('\uAC00', 39680, 61)},
            {'\u30FE', new ぉ('\u30FE', 1, 59)}, {'\u30FA', new ぉ('\u30FA', 8, 59)}, {'\u30F9', new ぉ('\u30F9', 8, 59)}, {'\u30F8', new ぉ('\u30F8', 8, 59)},
            {'\u30F7', new ぉ('\u30F7', 8, 59)}, {'\u30F4', new ぉ('\u30F4', 78, 59)}, {'\u30DD', new ぉ('\u30DD', 2, 60)}, {'\u30DC', new ぉ('\u30DC', 1, 59)},
            {'\u30DA', new ぉ('\u30DA', 2, 60)}, {'\u30D9', new ぉ('\u30D9', 1, 59)}, {'\u30D7', new ぉ('\u30D7', 2, 60)}, {'\u30D6', new ぉ('\u30D6', 1, 59)},
            {'\u30D4', new ぉ('\u30D4', 2, 60)}, {'\u30D3', new ぉ('\u30D3', 1, 59)}, {'\u30D1', new ぉ('\u30D1', 2, 60)}, {'\u30D0', new ぉ('\u30D0', 1, 59)},
            {'\u30C9', new ぉ('\u30C9', 1, 59)}, {'\u30C7', new ぉ('\u30C7', 1, 59)}, {'\u30C5', new ぉ('\u30C5', 1, 59)}, {'\u30C2', new ぉ('\u30C2', 1, 59)},
            {'\u30C0', new ぉ('\u30C0', 1, 59)}, {'\u30BE', new ぉ('\u30BE', 1, 59)}, {'\u30BC', new ぉ('\u30BC', 1, 59)}, {'\u30BA', new ぉ('\u30BA', 1, 59)},
            {'\u30B8', new ぉ('\u30B8', 1, 59)}, {'\u30B6', new ぉ('\u30B6', 1, 59)}, {'\u30B4', new ぉ('\u30B4', 1, 59)}, {'\u30B2', new ぉ('\u30B2', 1, 59)},
            {'\u30B0', new ぉ('\u30B0', 1, 59)}, {'\u30AE', new ぉ('\u30AE', 1, 59)}, {'\u30AC', new ぉ('\u30AC', 1, 59)}, {'\u309E', new ぉ('\u309E', 1, 59)},
            {'\u3094', new ぉ('\u3094', 78, 59)}, {'\u307D', new ぉ('\u307D', 2, 60)}, {'\u307C', new ぉ('\u307C', 1, 59)}, {'\u307A', new ぉ('\u307A', 2, 60)},
            {'\u3079', new ぉ('\u3079', 1, 59)}, {'\u3077', new ぉ('\u3077', 2, 60)}, {'\u3076', new ぉ('\u3076', 1, 59)}, {'\u3074', new ぉ('\u3074', 2, 60)},
            {'\u3073', new ぉ('\u3073', 1, 59)}, {'\u3071', new ぉ('\u3071', 2, 60)}, {'\u3070', new ぉ('\u3070', 1, 59)}, {'\u3069', new ぉ('\u3069', 1, 59)},
            {'\u3067', new ぉ('\u3067', 1, 59)}, {'\u3065', new ぉ('\u3065', 1, 59)}, {'\u3062', new ぉ('\u3062', 1, 59)}, {'\u3060', new ぉ('\u3060', 1, 59)},
            {'\u305E', new ぉ('\u305E', 1, 59)}, {'\u305C', new ぉ('\u305C', 1, 59)}, {'\u305A', new ぉ('\u305A', 1, 59)}, {'\u3058', new ぉ('\u3058', 1, 59)},
            {'\u3056', new ぉ('\u3056', 1, 59)}, {'\u3054', new ぉ('\u3054', 1, 59)}, {'\u3052', new ぉ('\u3052', 1, 59)}, {'\u3050', new ぉ('\u3050', 1, 59)},
            {'\u304E', new ぉ('\u304E', 1, 59)}, {'\u304C', new ぉ('\u304C', 1, 59)}, {'\u1FFC', new ぉ('\u1FFC', 7251, 57)}, {'\u1FFB', new ぉ('\u1FFB', 7250, 1)},
            {'\u1FFA', new ぉ('\u1FFA', 7249, 0)}, {'\u1FF9', new ぉ('\u1FF9', 7258, 1)}, {'\u1FF8', new ぉ('\u1FF8', 7257, 0)}, {'\u1FF6', new ぉ('\u1FF6', 7213, 58)},
            {'\u1FF3', new ぉ('\u1FF3', 7210, 57)}, {'\u1FEE', new ぉ('\u1FEE', 8006, 1)}, {'\u1FED', new ぉ('\u1FED', 8005, 0)}, {'\u1FEC', new ぉ('\u1FEC', 7243, 56)},
            {'\u1FEB', new ぉ('\u1FEB', 7238, 1)}, {'\u1FEA', new ぉ('\u1FEA', 7237, 0)}, {'\u1FE9', new ぉ('\u1FE9', 7236, 7)}, {'\u1FE8', new ぉ('\u1FE8', 7235, 8)},
            {'\u1FE6', new ぉ('\u1FE6', 7201, 58)}, {'\u1FE5', new ぉ('\u1FE5', 7204, 56)}, {'\u1FE4', new ぉ('\u1FE4', 7203, 55)}, {'\u1FE1', new ぉ('\u1FE1', 7196, 7)},
            {'\u1FE0', new ぉ('\u1FE0', 7195, 8)}, {'\u1FDF', new ぉ('\u1FDF', -31, 58)}, {'\u1FDE', new ぉ('\u1FDE', -32, 1)}, {'\u1FDD', new ぉ('\u1FDD', -33, 0)},
            {'\u1FDB', new ぉ('\u1FDB', 7234, 1)}, {'\u1FDA', new ぉ('\u1FDA', 7233, 0)}, {'\u1FD9', new ぉ('\u1FD9', 7232, 7)}, {'\u1FD8', new ぉ('\u1FD8', 7231, 8)},
            {'\u1FD6', new ぉ('\u1FD6', 7197, 58)}, {'\u1FD1', new ぉ('\u1FD1', 7192, 7)}, {'\u1FD0', new ぉ('\u1FD0', 7191, 8)}, {'\u1FCF', new ぉ('\u1FCF', 16, 58)},
            {'\u1FCE', new ぉ('\u1FCE', 15, 1)}, {'\u1FCD', new ぉ('\u1FCD', 14, 0)}, {'\u1FCC', new ぉ('\u1FCC', 7221, 57)}, {'\u1FCB', new ぉ('\u1FCB', 7220, 1)},
            {'\u1FCA', new ぉ('\u1FCA', 7219, 0)}, {'\u1FC9', new ぉ('\u1FC9', 7220, 1)}, {'\u1FC8', new ぉ('\u1FC8', 7219, 0)}, {'\u1FC6', new ぉ('\u1FC6', 7183, 58)},
            {'\u1FC3', new ぉ('\u1FC3', 7180, 57)}, {'\u1FC1', new ぉ('\u1FC1', 7961, 58)}, {'\u1FBC', new ぉ('\u1FBC', 7211, 57)}, {'\u1FBB', new ぉ('\u1FBB', 7210, 1)},
            {'\u1FBA', new ぉ('\u1FBA', 7209, 0)}, {'\u1FB9', new ぉ('\u1FB9', 7208, 7)}, {'\u1FB8', new ぉ('\u1FB8', 7207, 8)}, {'\u1FB6', new ぉ('\u1FB6', 7173, 58)},
            {'\u1FB3', new ぉ('\u1FB3', 7170, 57)}, {'\u1FB1', new ぉ('\u1FB1', 7168, 7)}, {'\u1FB0', new ぉ('\u1FB0', 7167, 8)}, {'\u1F7D', new ぉ('\u1F7D', 7092, 1)},
            {'\u1F7C', new ぉ('\u1F7C', 7091, 0)}, {'\u1F7B', new ぉ('\u1F7B', 7094, 1)}, {'\u1F7A', new ぉ('\u1F7A', 7093, 0)}, {'\u1F79', new ぉ('\u1F79', 7098, 1)},
            {'\u1F78', new ぉ('\u1F78', 7097, 0)}, {'\u1F77', new ぉ('\u1F77', 7102, 1)}, {'\u1F76', new ぉ('\u1F76', 7101, 0)}, {'\u1F75', new ぉ('\u1F75', 7102, 1)},
            {'\u1F74', new ぉ('\u1F74', 7101, 0)}, {'\u1F73', new ぉ('\u1F73', 7102, 1)}, {'\u1F72', new ぉ('\u1F72', 7101, 0)}, {'\u1F71', new ぉ('\u1F71', 7104, 1)},
            {'\u1F70', new ぉ('\u1F70', 7103, 0)}, {'\u1F69', new ぉ('\u1F69', 7104, 56)}, {'\u1F68', new ぉ('\u1F68', 7103, 55)}, {'\u1F61', new ぉ('\u1F61', 7064, 56)},
            {'\u1F60', new ぉ('\u1F60', 7063, 55)}, {'\u1F59', new ぉ('\u1F59', 7092, 56)}, {'\u1F51', new ぉ('\u1F51', 7052, 56)}, {'\u1F50', new ぉ('\u1F50', 7051, 55)},
            {'\u1F49', new ぉ('\u1F49', 7082, 56)}, {'\u1F48', new ぉ('\u1F48', 7081, 55)}, {'\u1F41', new ぉ('\u1F41', 7042, 56)}, {'\u1F40', new ぉ('\u1F40', 7041, 55)},
            {'\u1F39', new ぉ('\u1F39', 7072, 56)}, {'\u1F38', new ぉ('\u1F38', 7071, 55)}, {'\u1F31', new ぉ('\u1F31', 7032, 56)}, {'\u1F30', new ぉ('\u1F30', 7031, 55)},
            {'\u1F29', new ぉ('\u1F29', 7058, 56)}, {'\u1F28', new ぉ('\u1F28', 7057, 55)}, {'\u1F21', new ぉ('\u1F21', 7018, 56)}, {'\u1F20', new ぉ('\u1F20', 7017, 55)},
            {'\u1F19', new ぉ('\u1F19', 7044, 56)}, {'\u1F18', new ぉ('\u1F18', 7043, 55)}, {'\u1F11', new ぉ('\u1F11', 7004, 56)}, {'\u1F10', new ぉ('\u1F10', 7003, 55)},
            {'\u1F09', new ぉ('\u1F09', 7032, 56)}, {'\u1F08', new ぉ('\u1F08', 7031, 55)}, {'\u1F01', new ぉ('\u1F01', 6992, 56)}, {'\u1F00', new ぉ('\u1F00', 6991, 55)},
            {'\u1EF9', new ぉ('\u1EF9', 7808, 3)}, {'\u1EF8', new ぉ('\u1EF8', 7839, 3)}, {'\u1EF7', new ぉ('\u1EF7', 7806, 54)}, {'\u1EF6', new ぉ('\u1EF6', 7837, 54)},
            {'\u1EF5', new ぉ('\u1EF5', 7804, 48)}, {'\u1EF4', new ぉ('\u1EF4', 7835, 48)}, {'\u1EF3', new ぉ('\u1EF3', 7802, 0)}, {'\u1EF2', new ぉ('\u1EF2', 7833, 0)},
            {'\u1EE7', new ぉ('\u1EE7', 7794, 54)}, {'\u1EE6', new ぉ('\u1EE6', 7825, 54)}, {'\u1EE5', new ぉ('\u1EE5', 7792, 48)}, {'\u1EE4', new ぉ('\u1EE4', 7823, 48)},
            {'\u1ECF', new ぉ('\u1ECF', 7776, 54)}, {'\u1ECE', new ぉ('\u1ECE', 7807, 54)}, {'\u1ECD', new ぉ('\u1ECD', 7774, 48)}, {'\u1ECC', new ぉ('\u1ECC', 7805, 48)},
            {'\u1ECB', new ぉ('\u1ECB', 7778, 48)}, {'\u1ECA', new ぉ('\u1ECA', 7809, 48)}, {'\u1EC9', new ぉ('\u1EC9', 7776, 54)}, {'\u1EC8', new ぉ('\u1EC8', 7807, 54)},
            {'\u1EBD', new ぉ('\u1EBD', 7768, 3)}, {'\u1EBC', new ぉ('\u1EBC', 7799, 3)}, {'\u1EBB', new ぉ('\u1EBB', 7766, 54)}, {'\u1EBA', new ぉ('\u1EBA', 7797, 54)},
            {'\u1EB9', new ぉ('\u1EB9', 7764, 48)}, {'\u1EB8', new ぉ('\u1EB8', 7795, 48)}, {'\u1EA3', new ぉ('\u1EA3', 7746, 54)}, {'\u1EA2', new ぉ('\u1EA2', 7777, 54)},
            {'\u1EA1', new ぉ('\u1EA1', 7744, 48)}, {'\u1EA0', new ぉ('\u1EA0', 7775, 48)}, {'\u1E9B', new ぉ('\u1E9B', 7452, 10)}, {'\u1E99', new ぉ('\u1E99', 7712, 5)},
            {'\u1E98', new ぉ('\u1E98', 7713, 5)}, {'\u1E97', new ぉ('\u1E97', 7715, 4)}, {'\u1E96', new ぉ('\u1E96', 7726, 49)}, {'\u1E95', new ぉ('\u1E95', 7707, 49)},
            {'\u1E94', new ぉ('\u1E94', 7738, 49)}, {'\u1E93', new ぉ('\u1E93', 7705, 48)}, {'\u1E92', new ぉ('\u1E92', 7736, 48)}, {'\u1E91', new ぉ('\u1E91', 7703, 2)},
            {'\u1E90', new ぉ('\u1E90', 7734, 2)}, {'\u1E8F', new ぉ('\u1E8F', 7702, 10)}, {'\u1E8E', new ぉ('\u1E8E', 7733, 10)}, {'\u1E8D', new ぉ('\u1E8D', 7701, 4)},
            {'\u1E8C', new ぉ('\u1E8C', 7732, 4)}, {'\u1E8B', new ぉ('\u1E8B', 7699, 10)}, {'\u1E8A', new ぉ('\u1E8A', 7730, 10)}, {'\u1E89', new ぉ('\u1E89', 7698, 48)},
            {'\u1E88', new ぉ('\u1E88', 7729, 48)}, {'\u1E87', new ぉ('\u1E87', 7696, 10)}, {'\u1E86', new ぉ('\u1E86', 7727, 10)}, {'\u1E85', new ぉ('\u1E85', 7694, 4)},
            {'\u1E84', new ぉ('\u1E84', 7725, 4)}, {'\u1E83', new ぉ('\u1E83', 7692, 1)}, {'\u1E82', new ぉ('\u1E82', 7723, 1)}, {'\u1E81', new ぉ('\u1E81', 7690, 0)},
            {'\u1E80', new ぉ('\u1E80', 7721, 0)}, {'\u1E7F', new ぉ('\u1E7F', 7689, 48)}, {'\u1E7E', new ぉ('\u1E7E', 7720, 48)}, {'\u1E7D', new ぉ('\u1E7D', 7687, 3)},
            {'\u1E7C', new ぉ('\u1E7C', 7718, 3)}, {'\u1E77', new ぉ('\u1E77', 7682, 50)}, {'\u1E76', new ぉ('\u1E76', 7713, 50)}, {'\u1E75', new ぉ('\u1E75', 7680, 51)},
            {'\u1E74', new ぉ('\u1E74', 7711, 51)}, {'\u1E73', new ぉ('\u1E73', 7678, 53)}, {'\u1E72', new ぉ('\u1E72', 7709, 53)}, {'\u1E71', new ぉ('\u1E71', 7677, 50)},
            {'\u1E70', new ぉ('\u1E70', 7708, 50)}, {'\u1E6F', new ぉ('\u1E6F', 7675, 49)}, {'\u1E6E', new ぉ('\u1E6E', 7706, 49)}, {'\u1E6D', new ぉ('\u1E6D', 7673, 48)},
            {'\u1E6C', new ぉ('\u1E6C', 7704, 48)}, {'\u1E6B', new ぉ('\u1E6B', 7671, 10)}, {'\u1E6A', new ぉ('\u1E6A', 7702, 10)}, {'\u1E63', new ぉ('\u1E63', 7664, 48)},
            {'\u1E62', new ぉ('\u1E62', 7695, 48)}, {'\u1E61', new ぉ('\u1E61', 7662, 10)}, {'\u1E60', new ぉ('\u1E60', 7693, 10)}, {'\u1E5F', new ぉ('\u1E5F', 7661, 49)},
            {'\u1E5E', new ぉ('\u1E5E', 7692, 49)}, {'\u1E5B', new ぉ('\u1E5B', 7657, 48)}, {'\u1E5A', new ぉ('\u1E5A', 7688, 48)}, {'\u1E59', new ぉ('\u1E59', 7655, 10)},
            {'\u1E58', new ぉ('\u1E58', 7686, 10)}, {'\u1E57', new ぉ('\u1E57', 7655, 10)}, {'\u1E56', new ぉ('\u1E56', 7686, 10)}, {'\u1E55', new ぉ('\u1E55', 7653, 1)},
            {'\u1E54', new ぉ('\u1E54', 7684, 1)}, {'\u1E4B', new ぉ('\u1E4B', 7645, 50)}, {'\u1E4A', new ぉ('\u1E4A', 7676, 50)}, {'\u1E49', new ぉ('\u1E49', 7643, 49)},
            {'\u1E48', new ぉ('\u1E48', 7674, 49)}, {'\u1E47', new ぉ('\u1E47', 7641, 48)}, {'\u1E46', new ぉ('\u1E46', 7672, 48)}, {'\u1E45', new ぉ('\u1E45', 7639, 10)},
            {'\u1E44', new ぉ('\u1E44', 7670, 10)}, {'\u1E43', new ぉ('\u1E43', 7638, 48)}, {'\u1E42', new ぉ('\u1E42', 7669, 48)}, {'\u1E41', new ぉ('\u1E41', 7636, 10)},
            {'\u1E40', new ぉ('\u1E40', 7667, 10)}, {'\u1E3F', new ぉ('\u1E3F', 7634, 1)}, {'\u1E3E', new ぉ('\u1E3E', 7665, 1)}, {'\u1E3D', new ぉ('\u1E3D', 7633, 50)},
            {'\u1E3C', new ぉ('\u1E3C', 7664, 50)}, {'\u1E3B', new ぉ('\u1E3B', 7631, 49)}, {'\u1E3A', new ぉ('\u1E3A', 7662, 49)}, {'\u1E37', new ぉ('\u1E37', 7627, 48)},
            {'\u1E36', new ぉ('\u1E36', 7658, 48)}, {'\u1E35', new ぉ('\u1E35', 7626, 49)}, {'\u1E34', new ぉ('\u1E34', 7657, 49)}, {'\u1E33', new ぉ('\u1E33', 7624, 48)},
            {'\u1E32', new ぉ('\u1E32', 7655, 48)}, {'\u1E31', new ぉ('\u1E31', 7622, 1)}, {'\u1E30', new ぉ('\u1E30', 7653, 1)}, {'\u1E2D', new ぉ('\u1E2D', 7620, 51)},
            {'\u1E2C', new ぉ('\u1E2C', 7651, 51)}, {'\u1E2B', new ぉ('\u1E2B', 7619, 52)}, {'\u1E2A', new ぉ('\u1E2A', 7650, 52)}, {'\u1E29', new ぉ('\u1E29', 7617, 6)},
            {'\u1E28', new ぉ('\u1E28', 7648, 6)}, {'\u1E27', new ぉ('\u1E27', 7615, 4)}, {'\u1E26', new ぉ('\u1E26', 7646, 4)}, {'\u1E25', new ぉ('\u1E25', 7613, 48)},
            {'\u1E24', new ぉ('\u1E24', 7644, 48)}, {'\u1E23', new ぉ('\u1E23', 7611, 10)}, {'\u1E22', new ぉ('\u1E22', 7642, 10)}, {'\u1E21', new ぉ('\u1E21', 7610, 7)},
            {'\u1E20', new ぉ('\u1E20', 7641, 7)}, {'\u1E1F', new ぉ('\u1E1F', 7609, 10)}, {'\u1E1E', new ぉ('\u1E1E', 7640, 10)}, {'\u1E1B', new ぉ('\u1E1B', 7606, 51)},
            {'\u1E1A', new ぉ('\u1E1A', 7637, 51)}, {'\u1E19', new ぉ('\u1E19', 7604, 50)}, {'\u1E18', new ぉ('\u1E18', 7635, 50)}, {'\u1E13', new ぉ('\u1E13', 7599, 50)},
            {'\u1E12', new ぉ('\u1E12', 7630, 50)}, {'\u1E11', new ぉ('\u1E11', 7597, 6)}, {'\u1E10', new ぉ('\u1E10', 7628, 6)}, {'\u1E0F', new ぉ('\u1E0F', 7595, 49)},
            {'\u1E0E', new ぉ('\u1E0E', 7626, 49)}, {'\u1E0D', new ぉ('\u1E0D', 7593, 48)}, {'\u1E0C', new ぉ('\u1E0C', 7624, 48)}, {'\u1E0B', new ぉ('\u1E0B', 7591, 10)},
            {'\u1E0A', new ぉ('\u1E0A', 7622, 10)}, {'\u1E07', new ぉ('\u1E07', 7589, 49)}, {'\u1E06', new ぉ('\u1E06', 7620, 49)}, {'\u1E05', new ぉ('\u1E05', 7587, 48)},
            {'\u1E04', new ぉ('\u1E04', 7618, 48)}, {'\u1E03', new ぉ('\u1E03', 7585, 10)}, {'\u1E02', new ぉ('\u1E02', 7616, 10)}, {'\u1E01', new ぉ('\u1E01', 7584, 47)},
            {'\u1E00', new ぉ('\u1E00', 7615, 47)}, {'\u1B43', new ぉ('\u1B43', 1, 46)}, {'\u1B41', new ぉ('\u1B41', 2, 46)}, {'\u1B40', new ぉ('\u1B40', 2, 46)},
            {'\u1B3D', new ぉ('\u1B3D', 1, 46)}, {'\u1B3B', new ぉ('\u1B3B', 1, 46)}, {'\u1B12', new ぉ('\u1B12', 1, 46)}, {'\u1B0E', new ぉ('\u1B0E', 1, 46)},
            {'\u1B0C', new ぉ('\u1B0C', 1, 46)}, {'\u1B0A', new ぉ('\u1B0A', 1, 46)}, {'\u1B08', new ぉ('\u1B08', 1, 46)}, {'\u1B06', new ぉ('\u1B06', 1, 46)},
            {'\u1026', new ぉ('\u1026', 1, 45)}, {'\u0FB9', new ぉ('\u0FB9', 41, 41)}, {'\u0FAC', new ぉ('\u0FAC', 1, 40)}, {'\u0FA7', new ぉ('\u0FA7', 1, 40)},
            {'\u0FA2', new ぉ('\u0FA2', 1, 40)}, {'\u0F9D', new ぉ('\u0F9D', 1, 40)}, {'\u0F93', new ぉ('\u0F93', 1, 40)}, {'\u0F81', new ぉ('\u0F81', 16, 44)},
            {'\u0F78', new ぉ('\u0F78', -59, 44)}, {'\u0F76', new ぉ('\u0F76', -60, 44)}, {'\u0F75', new ぉ('\u0F75', 4, 43)}, {'\u0F73', new ぉ('\u0F73', 2, 42)},
            {'\u0F69', new ぉ('\u0F69', 41, 41)}, {'\u0F5C', new ぉ('\u0F5C', 1, 40)}, {'\u0F57', new ぉ('\u0F57', 1, 40)}, {'\u0F52', new ぉ('\u0F52', 1, 40)},
            {'\u0F4D', new ぉ('\u0F4D', 1, 40)}, {'\u0F43', new ぉ('\u0F43', 1, 40)}, {'\u0DDE', new ぉ('\u0DDE', 5, 39)}, {'\u0DDC', new ぉ('\u0DDC', 3, 38)},
            {'\u0DDA', new ぉ('\u0DDA', 1, 37)}, {'\u0D4C', new ぉ('\u0D4C', 6, 36)}, {'\u0D4B', new ぉ('\u0D4B', 4, 35)}, {'\u0D4A', new ぉ('\u0D4A', 4, 35)},
            {'\u0CCA', new ぉ('\u0CCA', 4, 34)}, {'\u0CC8', new ぉ('\u0CC8', 2, 33)}, {'\u0CC7', new ぉ('\u0CC7', 1, 32)}, {'\u0CC0', new ぉ('\u0CC0', 1, 32)},
            {'\u0C48', new ぉ('\u0C48', 2, 31)}, {'\u0BCC', new ぉ('\u0BCC', 6, 29)}, {'\u0BCB', new ぉ('\u0BCB', 4, 30)}, {'\u0BCA', new ぉ('\u0BCA', 4, 30)},
            {'\u0B94', new ぉ('\u0B94', 2, 29)}, {'\u0B5D', new ぉ('\u0B5D', 59, 28)}, {'\u0B5C', new ぉ('\u0B5C', 59, 28)}, {'\u0B4C', new ぉ('\u0B4C', 5, 27)},
            {'\u0B4B', new ぉ('\u0B4B', 4, 26)}, {'\u0B48', new ぉ('\u0B48', 1, 25)}, {'\u0A5E', new ぉ('\u0A5E', 51, 24)}, {'\u0A5B', new ぉ('\u0A5B', 63, 24)},
            {'\u0A5A', new ぉ('\u0A5A', 67, 24)}, {'\u0A59', new ぉ('\u0A59', 67, 24)}, {'\u0A36', new ぉ('\u0A36', -2, 24)}, {'\u0A33', new ぉ('\u0A33', 1, 24)},
            {'\u09DF', new ぉ('\u09DF', 48, 23)}, {'\u09DD', new ぉ('\u09DD', 59, 23)}, {'\u09DC', new ぉ('\u09DC', 59, 23)}, {'\u09CC', new ぉ('\u09CC', 5, 22)},
            {'\u09CB', new ぉ('\u09CB', 4, 21)}, {'\u095F', new ぉ('\u095F', 48, 20)}, {'\u095E', new ぉ('\u095E', 51, 20)}, {'\u095D', new ぉ('\u095D', 59, 20)},
            {'\u095C', new ぉ('\u095C', 59, 20)}, {'\u095B', new ぉ('\u095B', 63, 20)}, {'\u095A', new ぉ('\u095A', 67, 20)}, {'\u0959', new ぉ('\u0959', 67, 20)},
            {'\u0958', new ぉ('\u0958', 67, 20)}, {'\u0934', new ぉ('\u0934', 1, 20)}, {'\u0931', new ぉ('\u0931', 1, 20)}, {'\u0929', new ぉ('\u0929', 1, 20)},
            {'\u06D3', new ぉ('\u06D3', 1, 18)}, {'\u06C2', new ぉ('\u06C2', 1, 18)}, {'\u06C0', new ぉ('\u06C0', -21, 18)}, {'\u0626', new ぉ('\u0626', -36, 18)},
            {'\u0625', new ぉ('\u0625', -2, 19)}, {'\u0624', new ぉ('\u0624', -36, 18)}, {'\u0623', new ぉ('\u0623', -4, 18)}, {'\u0622', new ぉ('\u0622', -5, 17)},
            {'\u04F9', new ぉ('\u04F9', 174, 4)}, {'\u04F8', new ぉ('\u04F8', 205, 4)}, {'\u04F5', new ぉ('\u04F5', 174, 4)}, {'\u04F4', new ぉ('\u04F4', 205, 4)},
            {'\u04F3', new ぉ('\u04F3', 176, 12)}, {'\u04F2', new ぉ('\u04F2', 207, 12)}, {'\u04F1', new ぉ('\u04F1', 174, 4)}, {'\u04F0', new ぉ('\u04F0', 205, 4)},
            {'\u04EF', new ぉ('\u04EF', 172, 7)}, {'\u04EE', new ぉ('\u04EE', 203, 7)}, {'\u04ED', new ぉ('\u04ED', 160, 4)}, {'\u04EC', new ぉ('\u04EC', 191, 4)},
            {'\u04EB', new ぉ('\u04EB', 2, 4)}, {'\u04EA', new ぉ('\u04EA', 2, 4)}, {'\u04E7', new ぉ('\u04E7', 169, 4)}, {'\u04E6', new ぉ('\u04E6', 200, 4)},
            {'\u04E5', new ぉ('\u04E5', 173, 4)}, {'\u04E4', new ぉ('\u04E4', 204, 4)}, {'\u04E3', new ぉ('\u04E3', 171, 7)}, {'\u04E2', new ぉ('\u04E2', 202, 7)},
            {'\u04DF', new ぉ('\u04DF', 168, 4)}, {'\u04DE', new ぉ('\u04DE', 199, 4)}, {'\u04DD', new ぉ('\u04DD', 167, 4)}, {'\u04DC', new ぉ('\u04DC', 198, 4)},
            {'\u04DB', new ぉ('\u04DB', 2, 4)}, {'\u04DA', new ぉ('\u04DA', 2, 4)}, {'\u04D7', new ぉ('\u04D7', 162, 8)}, {'\u04D6', new ぉ('\u04D6', 193, 8)},
            {'\u04D3', new ぉ('\u04D3', 163, 4)}, {'\u04D2', new ぉ('\u04D2', 194, 4)}, {'\u04D1', new ぉ('\u04D1', 161, 8)}, {'\u04D0', new ぉ('\u04D0', 192, 8)},
            {'\u04C2', new ぉ('\u04C2', 140, 8)}, {'\u04C1', new ぉ('\u04C1', 171, 8)}, {'\u0477', new ぉ('\u0477', 2, 14)}, {'\u0476', new ぉ('\u0476', 2, 14)},
            {'\u045E', new ぉ('\u045E', 27, 8)}, {'\u045D', new ぉ('\u045D', 37, 0)}, {'\u045C', new ぉ('\u045C', 34, 1)}, {'\u0457', new ぉ('\u0457', 1, 4)},
            {'\u0453', new ぉ('\u0453', 32, 1)}, {'\u0451', new ぉ('\u0451', 28, 4)}, {'\u0450', new ぉ('\u0450', 27, 0)}, {'\u0439', new ぉ('\u0439', 1, 8)},
            {'\u0419', new ぉ('\u0419', 1, 8)}, {'\u040E', new ぉ('\u040E', -21, 8)}, {'\u040D', new ぉ('\u040D', -11, 0)}, {'\u040C', new ぉ('\u040C', -14, 1)},
            {'\u0407', new ぉ('\u0407', 1, 4)}, {'\u0403', new ぉ('\u0403', -16, 1)}, {'\u0401', new ぉ('\u0401', -20, 4)}, {'\u0400', new ぉ('\u0400', -21, 0)},
            {'\u03D4', new ぉ('\u03D4', 2, 4)}, {'\u03D3', new ぉ('\u03D3', 1, 1)}, {'\u03CE', new ぉ('\u03CE', 5, 1)}, {'\u03CD', new ぉ('\u03CD', 8, 1)},
            {'\u03CC', new ぉ('\u03CC', 13, 1)}, {'\u03CB', new ぉ('\u03CB', 6, 4)}, {'\u03CA', new ぉ('\u03CA', 17, 4)}, {'\u03AF', new ぉ('\u03AF', -10, 1)},
            {'\u03AE', new ぉ('\u03AE', -9, 1)}, {'\u03AD', new ぉ('\u03AD', -8, 1)}, {'\u03AC', new ぉ('\u03AC', -5, 1)}, {'\u03AB', new ぉ('\u03AB', 6, 4)},
            {'\u03AA', new ぉ('\u03AA', 17, 4)}, {'\u038F', new ぉ('\u038F', -26, 1)}, {'\u038E', new ぉ('\u038E', -23, 1)}, {'\u038C', new ぉ('\u038C', -19, 1)},
            {'\u038A', new ぉ('\u038A', -15, 1)}, {'\u0389', new ぉ('\u0389', -14, 1)}, {'\u0388', new ぉ('\u0388', -13, 1)}, {'\u0386', new ぉ('\u0386', -11, 1)},
            {'\u0385', new ぉ('\u0385', 733, 1)}, {'\u0344', new ぉ('\u0344', 60, 1)}, {'\u0233', new ぉ('\u0233', 442, 7)}, {'\u0232', new ぉ('\u0232', 473, 7)},
            {'\u022F', new ぉ('\u022F', 448, 10)}, {'\u022E', new ぉ('\u022E', 479, 10)}, {'\u0229', new ぉ('\u0229', 452, 6)}, {'\u0228', new ぉ('\u0228', 483, 6)},
            {'\u0227', new ぉ('\u0227', 454, 10)}, {'\u0226', new ぉ('\u0226', 485, 10)}, {'\u021F', new ぉ('\u021F', 439, 11)}, {'\u021E', new ぉ('\u021E', 470, 11)},
            {'\u021B', new ぉ('\u021B', 423, 16)}, {'\u021A', new ぉ('\u021A', 454, 16)}, {'\u0219', new ぉ('\u0219', 422, 16)}, {'\u0218', new ぉ('\u0218', 453, 16)},
            {'\u0217', new ぉ('\u0217', 418, 15)}, {'\u0216', new ぉ('\u0216', 449, 15)}, {'\u0215', new ぉ('\u0215', 416, 14)}, {'\u0214', new ぉ('\u0214', 447, 14)},
            {'\u0213', new ぉ('\u0213', 417, 15)}, {'\u0212', new ぉ('\u0212', 448, 15)}, {'\u0211', new ぉ('\u0211', 415, 14)}, {'\u0210', new ぉ('\u0210', 446, 14)},
            {'\u020F', new ぉ('\u020F', 416, 15)}, {'\u020E', new ぉ('\u020E', 447, 15)}, {'\u020D', new ぉ('\u020D', 414, 14)}, {'\u020C', new ぉ('\u020C', 445, 14)},
            {'\u020B', new ぉ('\u020B', 418, 15)}, {'\u020A', new ぉ('\u020A', 449, 15)}, {'\u0209', new ぉ('\u0209', 416, 14)}, {'\u0208', new ぉ('\u0208', 447, 14)},
            {'\u0207', new ぉ('\u0207', 418, 15)}, {'\u0206', new ぉ('\u0206', 449, 15)}, {'\u0205', new ぉ('\u0205', 416, 14)}, {'\u0204', new ぉ('\u0204', 447, 14)},
            {'\u0203', new ぉ('\u0203', 418, 15)}, {'\u0202', new ぉ('\u0202', 449, 15)}, {'\u0201', new ぉ('\u0201', 416, 14)}, {'\u0200', new ぉ('\u0200', 447, 14)},
            {'\u01FF', new ぉ('\u01FF', 263, 1)}, {'\u01FE', new ぉ('\u01FE', 294, 1)}, {'\u01FD', new ぉ('\u01FD', 279, 1)}, {'\u01FC', new ぉ('\u01FC', 310, 1)},
            {'\u01F9', new ぉ('\u01F9', 395, 0)}, {'\u01F8', new ぉ('\u01F8', 426, 0)}, {'\u01F5', new ぉ('\u01F5', 398, 1)}, {'\u01F4', new ぉ('\u01F4', 429, 1)},
            {'\u01F0', new ぉ('\u01F0', 390, 11)}, {'\u01EF', new ぉ('\u01EF', -163, 11)}, {'\u01EE', new ぉ('\u01EE', 55, 11)}, {'\u01EB', new ぉ('\u01EB', 380, 9)},
            {'\u01EA', new ぉ('\u01EA', 411, 9)}, {'\u01E9', new ぉ('\u01E9', 382, 11)}, {'\u01E8', new ぉ('\u01E8', 413, 11)}, {'\u01E7', new ぉ('\u01E7', 384, 11)},
            {'\u01E6', new ぉ('\u01E6', 415, 11)}, {'\u01E3', new ぉ('\u01E3', 253, 7)}, {'\u01E2', new ぉ('\u01E2', 284, 7)}, {'\u01D4', new ぉ('\u01D4', 351, 11)},
            {'\u01D3', new ぉ('\u01D3', 382, 11)}, {'\u01D2', new ぉ('\u01D2', 355, 11)}, {'\u01D1', new ぉ('\u01D1', 386, 11)}, {'\u01D0', new ぉ('\u01D0', 359, 11)},
            {'\u01CF', new ぉ('\u01CF', 390, 11)}, {'\u01CE', new ぉ('\u01CE', 365, 11)}, {'\u01CD', new ぉ('\u01CD', 396, 11)}, {'\u01B0', new ぉ('\u01B0', 315, 13)},
            {'\u01AF', new ぉ('\u01AF', 346, 13)}, {'\u01A1', new ぉ('\u01A1', 306, 13)}, {'\u01A0', new ぉ('\u01A0', 337, 13)}, {'\u017E', new ぉ('\u017E', 260, 11)},
            {'\u017D', new ぉ('\u017D', 291, 11)}, {'\u017C', new ぉ('\u017C', 258, 10)}, {'\u017B', new ぉ('\u017B', 289, 10)}, {'\u017A', new ぉ('\u017A', 256, 1)},
            {'\u0179', new ぉ('\u0179', 287, 1)}, {'\u0178', new ぉ('\u0178', 287, 4)}, {'\u0177', new ぉ('\u0177', 254, 2)}, {'\u0176', new ぉ('\u0176', 285, 2)},
            {'\u0175', new ぉ('\u0175', 254, 2)}, {'\u0174', new ぉ('\u0174', 285, 2)}, {'\u0173', new ぉ('\u0173', 254, 9)}, {'\u0172', new ぉ('\u0172', 285, 9)},
            {'\u0171', new ぉ('\u0171', 252, 12)}, {'\u0170', new ぉ('\u0170', 283, 12)}, {'\u016F', new ぉ('\u016F', 250, 5)}, {'\u016E', new ぉ('\u016E', 281, 5)},
            {'\u016D', new ぉ('\u016D', 248, 8)}, {'\u016C', new ぉ('\u016C', 279, 8)}, {'\u016B', new ぉ('\u016B', 246, 7)}, {'\u016A', new ぉ('\u016A', 277, 7)},
            {'\u0169', new ぉ('\u0169', 244, 3)}, {'\u0168', new ぉ('\u0168', 275, 3)}, {'\u0165', new ぉ('\u0165', 241, 11)}, {'\u0164', new ぉ('\u0164', 272, 11)},
            {'\u0163', new ぉ('\u0163', 239, 6)}, {'\u0162', new ぉ('\u0162', 270, 6)}, {'\u0161', new ぉ('\u0161', 238, 11)}, {'\u0160', new ぉ('\u0160', 269, 11)},
            {'\u015F', new ぉ('\u015F', 236, 6)}, {'\u015E', new ぉ('\u015E', 267, 6)}, {'\u015D', new ぉ('\u015D', 234, 2)}, {'\u015C', new ぉ('\u015C', 265, 2)},
            {'\u015B', new ぉ('\u015B', 232, 1)}, {'\u015A', new ぉ('\u015A', 263, 1)}, {'\u0159', new ぉ('\u0159', 231, 11)}, {'\u0158', new ぉ('\u0158', 262, 11)},
            {'\u0157', new ぉ('\u0157', 229, 6)}, {'\u0156', new ぉ('\u0156', 260, 6)}, {'\u0155', new ぉ('\u0155', 227, 1)}, {'\u0154', new ぉ('\u0154', 258, 1)},
            {'\u0151', new ぉ('\u0151', 226, 12)}, {'\u0150', new ぉ('\u0150', 257, 12)}, {'\u014F', new ぉ('\u014F', 224, 8)}, {'\u014E', new ぉ('\u014E', 255, 8)},
            {'\u014D', new ぉ('\u014D', 222, 7)}, {'\u014C', new ぉ('\u014C', 253, 7)}, {'\u0148', new ぉ('\u0148', 218, 11)}, {'\u0147', new ぉ('\u0147', 249, 11)},
            {'\u0146', new ぉ('\u0146', 216, 6)}, {'\u0145', new ぉ('\u0145', 247, 6)}, {'\u0144', new ぉ('\u0144', 214, 1)}, {'\u0143', new ぉ('\u0143', 245, 1)},
            {'\u013E', new ぉ('\u013E', 210, 11)}, {'\u013D', new ぉ('\u013D', 241, 11)}, {'\u013C', new ぉ('\u013C', 208, 6)}, {'\u013B', new ぉ('\u013B', 239, 6)},
            {'\u013A', new ぉ('\u013A', 206, 1)}, {'\u0139', new ぉ('\u0139', 237, 1)}, {'\u0137', new ぉ('\u0137', 204, 6)}, {'\u0136', new ぉ('\u0136', 235, 6)},
            {'\u0135', new ぉ('\u0135', 203, 2)}, {'\u0134', new ぉ('\u0134', 234, 2)}, {'\u0130', new ぉ('\u0130', 231, 10)}, {'\u012F', new ぉ('\u012F', 198, 9)},
            {'\u012E', new ぉ('\u012E', 229, 9)}, {'\u012D', new ぉ('\u012D', 196, 8)}, {'\u012C', new ぉ('\u012C', 227, 8)}, {'\u012B', new ぉ('\u012B', 194, 7)},
            {'\u012A', new ぉ('\u012A', 225, 7)}, {'\u0129', new ぉ('\u0129', 192, 3)}, {'\u0128', new ぉ('\u0128', 223, 3)}, {'\u0125', new ぉ('\u0125', 189, 2)},
            {'\u0124', new ぉ('\u0124', 220, 2)}, {'\u0123', new ぉ('\u0123', 188, 6)}, {'\u0122', new ぉ('\u0122', 219, 6)}, {'\u0121', new ぉ('\u0121', 186, 10)},
            {'\u0120', new ぉ('\u0120', 217, 10)}, {'\u011F', new ぉ('\u011F', 184, 8)}, {'\u011E', new ぉ('\u011E', 215, 8)}, {'\u011D', new ぉ('\u011D', 182, 2)},
            {'\u011C', new ぉ('\u011C', 213, 2)}, {'\u011B', new ぉ('\u011B', 182, 11)}, {'\u011A', new ぉ('\u011A', 213, 11)}, {'\u0119', new ぉ('\u0119', 180, 9)},
            {'\u0118', new ぉ('\u0118', 211, 9)}, {'\u0117', new ぉ('\u0117', 178, 10)}, {'\u0116', new ぉ('\u0116', 209, 10)}, {'\u0115', new ぉ('\u0115', 176, 8)},
            {'\u0114', new ぉ('\u0114', 207, 8)}, {'\u0113', new ぉ('\u0113', 174, 7)}, {'\u0112', new ぉ('\u0112', 205, 7)}, {'\u010F', new ぉ('\u010F', 171, 11)},
            {'\u010E', new ぉ('\u010E', 202, 11)}, {'\u010D', new ぉ('\u010D', 170, 11)}, {'\u010C', new ぉ('\u010C', 201, 11)}, {'\u010B', new ぉ('\u010B', 168, 10)},
            {'\u010A', new ぉ('\u010A', 199, 10)}, {'\u0109', new ぉ('\u0109', 166, 2)}, {'\u0108', new ぉ('\u0108', 197, 2)}, {'\u0107', new ぉ('\u0107', 164, 1)},
            {'\u0106', new ぉ('\u0106', 195, 1)}, {'\u0105', new ぉ('\u0105', 164, 9)}, {'\u0104', new ぉ('\u0104', 195, 9)}, {'\u0103', new ぉ('\u0103', 162, 8)},
            {'\u0102', new ぉ('\u0102', 193, 8)}, {'\u0101', new ぉ('\u0101', 160, 7)}, {'\u0100', new ぉ('\u0100', 191, 7)}, {'\u00FF', new ぉ('\u00FF', 134, 4)},
            {'\u00FD', new ぉ('\u00FD', 132, 1)}, {'\u00FC', new ぉ('\u00FC', 135, 4)}, {'\u00FB', new ぉ('\u00FB', 134, 2)}, {'\u00FA', new ぉ('\u00FA', 133, 1)},
            {'\u00F9', new ぉ('\u00F9', 132, 0)}, {'\u00F6', new ぉ('\u00F6', 135, 4)}, {'\u00F5', new ぉ('\u00F5', 134, 3)}, {'\u00F4', new ぉ('\u00F4', 133, 2)},
            {'\u00F3', new ぉ('\u00F3', 132, 1)}, {'\u00F2', new ぉ('\u00F2', 131, 0)}, {'\u00F1', new ぉ('\u00F1', 131, 3)}, {'\u00EF', new ぉ('\u00EF', 134, 4)},
            {'\u00EE', new ぉ('\u00EE', 133, 2)}, {'\u00ED', new ぉ('\u00ED', 132, 1)}, {'\u00EC', new ぉ('\u00EC', 131, 0)}, {'\u00EB', new ぉ('\u00EB', 134, 4)},
            {'\u00EA', new ぉ('\u00EA', 133, 2)}, {'\u00E9', new ぉ('\u00E9', 132, 1)}, {'\u00E8', new ぉ('\u00E8', 131, 0)}, {'\u00E7', new ぉ('\u00E7', 132, 6)},
            {'\u00E5', new ぉ('\u00E5', 132, 5)}, {'\u00E4', new ぉ('\u00E4', 131, 4)}, {'\u00E3', new ぉ('\u00E3', 130, 3)}, {'\u00E2', new ぉ('\u00E2', 129, 2)},
            {'\u00E1', new ぉ('\u00E1', 128, 1)}, {'\u00E0', new ぉ('\u00E0', 127, 0)}, {'\u00DD', new ぉ('\u00DD', 132, 1)}, {'\u00DC', new ぉ('\u00DC', 135, 4)},
            {'\u00DB', new ぉ('\u00DB', 134, 2)}, {'\u00DA', new ぉ('\u00DA', 133, 1)}, {'\u00D9', new ぉ('\u00D9', 132, 0)}, {'\u00D6', new ぉ('\u00D6', 135, 4)},
            {'\u00D5', new ぉ('\u00D5', 134, 3)}, {'\u00D4', new ぉ('\u00D4', 133, 2)}, {'\u00D3', new ぉ('\u00D3', 132, 1)}, {'\u00D2', new ぉ('\u00D2', 131, 0)},
            {'\u00D1', new ぉ('\u00D1', 131, 3)}, {'\u00CF', new ぉ('\u00CF', 134, 4)}, {'\u00CE', new ぉ('\u00CE', 133, 2)}, {'\u00CD', new ぉ('\u00CD', 132, 1)},
            {'\u00CC', new ぉ('\u00CC', 131, 0)}, {'\u00CB', new ぉ('\u00CB', 134, 4)}, {'\u00CA', new ぉ('\u00CA', 133, 2)}, {'\u00C9', new ぉ('\u00C9', 132, 1)},
            {'\u00C8', new ぉ('\u00C8', 131, 0)}, {'\u00C7', new ぉ('\u00C7', 132, 6)}, {'\u00C5', new ぉ('\u00C5', 132, 5)}, {'\u00C4', new ぉ('\u00C4', 131, 4)},
            {'\u00C3', new ぉ('\u00C3', 130, 3)}, {'\u00C2', new ぉ('\u00C2', 129, 2)}, {'\u00C1', new ぉ('\u00C1', 128, 1)}, {'\u00C0', new ぉ('\u00C0', 127, 0)},
        };
    }
}
